[
  {
    "arxiv_id": "1706.03762v7",
    "title": "Attention Is All You Need",
    "authors": [
      "Ashish Vaswani",
      "Noam Shazeer",
      "Niki Parmar",
      "Jakob Uszkoreit",
      "Llion Jones",
      "Aidan N. Gomez",
      "Lukasz Kaiser",
      "Illia Polosukhin"
    ],
    "abstract": "The dominant sequence transduction models are based on complex recurrent or\nconvolutional neural networks in an encoder-decoder configuration. The best\nperforming models also connect the encoder and decoder through an attention\nmechanism. We propose a new simple network architecture, the Transformer, based\nsolely on attention mechanisms, dispensing with recurrence and convolutions\nentirely. Experiments on two machine translation tasks show these models to be\nsuperior in quality while being more parallelizable and requiring significantly\nless time to train. Our model achieves 28.4 BLEU on the WMT 2014\nEnglish-to-German translation task, improving over the existing best results,\nincluding ensembles by over 2 BLEU. On the WMT 2014 English-to-French\ntranslation task, our model establishes a new single-model state-of-the-art\nBLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction\nof the training costs of the best models from the literature. We show that the\nTransformer generalizes well to other tasks by applying it successfully to\nEnglish constituency parsing both with large and limited training data.",
    "published": "2017-06-12",
    "updated": "2023-08-02",
    "categories": [
      "cs.CL",
      "cs.LG"
    ],
    "primary_category": "cs.CL",
    "pdf_url": "http://arxiv.org/pdf/1706.03762v7",
    "doi": null,
    "journal_ref": null,
    "comment": "15 pages, 5 figures",
    "pdf_path": "data\\pdfs\\1706.03762v7.pdf",
    "download_status": "success"
  },
  {
    "arxiv_id": "2103.14030v2",
    "title": "Swin Transformer: Hierarchical Vision Transformer using Shifted Windows",
    "authors": [
      "Ze Liu",
      "Yutong Lin",
      "Yue Cao",
      "Han Hu",
      "Yixuan Wei",
      "Zheng Zhang",
      "Stephen Lin",
      "Baining Guo"
    ],
    "abstract": "This paper presents a new vision Transformer, called Swin Transformer, that\ncapably serves as a general-purpose backbone for computer vision. Challenges in\nadapting Transformer from language to vision arise from differences between the\ntwo domains, such as large variations in the scale of visual entities and the\nhigh resolution of pixels in images compared to words in text. To address these\ndifferences, we propose a hierarchical Transformer whose representation is\ncomputed with \\textbf{S}hifted \\textbf{win}dows. The shifted windowing scheme\nbrings greater efficiency by limiting self-attention computation to\nnon-overlapping local windows while also allowing for cross-window connection.\nThis hierarchical architecture has the flexibility to model at various scales\nand has linear computational complexity with respect to image size. These\nqualities of Swin Transformer make it compatible with a broad range of vision\ntasks, including image classification (87.3 top-1 accuracy on ImageNet-1K) and\ndense prediction tasks such as object detection (58.7 box AP and 51.1 mask AP\non COCO test-dev) and semantic segmentation (53.5 mIoU on ADE20K val). Its\nperformance surpasses the previous state-of-the-art by a large margin of +2.7\nbox AP and +2.6 mask AP on COCO, and +3.2 mIoU on ADE20K, demonstrating the\npotential of Transformer-based models as vision backbones. The hierarchical\ndesign and the shifted window approach also prove beneficial for all-MLP\narchitectures. The code and models are publicly available\nat~\\url{https://github.com/microsoft/Swin-Transformer}.",
    "published": "2021-03-25",
    "updated": "2021-08-17",
    "categories": [
      "cs.CV",
      "cs.LG"
    ],
    "primary_category": "cs.CV",
    "pdf_url": "http://arxiv.org/pdf/2103.14030v2",
    "doi": null,
    "journal_ref": null,
    "comment": null,
    "pdf_path": "data\\pdfs\\2103.14030v2.pdf",
    "download_status": "success"
  }
]