{
  "methods": "Methods. The noise amplitude scales with the 95th-percentile velocity U , and higher-shear regions 95 receive proportionally larger perturbations, reproducing the anisotropic error structure of experimental velocimetry measurements. We first examine the effect of spatial resolution by varying W while keeping the noise parameters fixed. As win shown in Fig. S4a, the trained TBNN maintains its predictive accuracy, quantified by the relative root-mean-squared error(RRMSE ),evenwhentheresolutionisreducedto13×13interrogationwindows. Thisrobustnessdemonstrates u that spatially coarse flow measurements remain highly informative, containing sufficient kinematic diversity to re- cover the underlying constitutive behavior, far beyond what is accessible from traditional bulk rheometry. Example downsampled reconstructions are shown in Fig. S4b,c. We next examine the effect of measurement noise using the same correlated, heteroskedastic model. Here the noise level on the horizontal axis of Fig. S5a is defined as the amplitude of the base scale σ = αU , expressed as a base 95 percentage of the 95th-percentile velocity magnitude U . As the noise amplitude increases, the RRMSE between the 95 TBNN prediction and the ground-truth field rises slightly but remains low, even for perturbations as large as 4% U . Although the total loss cannot decrease as much in these cases, reflecting the irreducible mismatch introduced 95 by measurement noise (Fig. S6a), the trained model still captures the underlying flow structure with high fidelity (Fig. S6b). This robustness underscores a key advantage of our differentiable formulation: by enforcing the governing equationsashardconstraints,themodelresistsoverfittingnoisydataandinsteadconvergestothephysicallyconsistent constitutive relation, even when the available information is degraded. SUPPLEMENTARY FIGURES FIG.S1. Examplekinematicandrheologicalfieldsusedfortraining. (a)Localstrain-ratemagnitudelog (γ˙)showing 10 the broad range of kinematic conditions sampled within the constriction geometry for a shear-thinning fluid with parameters η 0=1.0,η ∞=0.02,k=5.0,n=0.7,anda=2.0. (b)Correspondingviscosityfieldlog 10(η/η 0)fromtheCarreau–Yasudamodel, demonstrating a wide range of local viscosities and strong shear thinning in the throat region. --- Page 15 --- 15 FIG. S2. Velocity-field reconstruction and errors. Comparison between ground-truth and TBNN-predicted velocity componentsfortheconstrictiongeometry. (a,b)y-velocityfieldsshowingnear-perfectrecoveryofthecross-streamflowstructure (u ). (c,d)Absolutedifferencesforu andu (thecorrespondingground-truthandTBNNu fieldsareshowninFig.2ofthe y y x x main text), indicating very low absolute errors compared with the flow magnitude. FIG. S3. Generalization to unseen geometry. Comparison between TBNN predictions and ground-truth fields for flow through a bidisperse porous array. (a,b) Ground-truth and predicted u fields. (c) Absolute error in u . (d–f) Analogous x x comparison for u . The learned closure transfers successfully to an out-of-training pressure drive in a geometry with different y boundary conditions, preserving spatial structure and amplitude of both velocity components. --- Page 16 --- 16 FIG. S4. Robustness to coarse spatial resolution. (a) Relative root-mean-squared error (RRMSE ) of predicted velocity u fields as a function of synthetic PIV resolution, with error bars showing variation across three separate runs. (b,c) Example downsampled velocity inputs used in training from the finest (61×61) and coarsest (13×13) resolutions. Despite heavy down- sampling, the trained model captures the dominant flow structures and reproduces velocity magnitudes with very low global error. FIG. S5. Robustness to measurement noise. (a) RRMSE of TBNN-predicted velocity fields versus synthetic PIV u noise level, with error bars showing variation across five separate runs except the no noise case where we performed three repetitions. (b,c)Representativereconstructionsfor0.5%and4.0%noiseamplitudesrelativetoU . Predictionsremainstable 95 andphysicallyconsistentevenathighnoiselevels,confirmingthatthedifferentiablesolveractsasastrongphysicalregularizer. --- Page 17 --- 17 FIG.S6. Training convergence and velocity-profile recovery for noisy data. (a)Evolutionofthelossfunctionduring TBNN training for 4.0% noise amplitude relative to U shows a smaller decrease than the noise-free example, reflecting the 95 irreducible mismatch introduced by measurement noise. (b) Axial velocity profile at the constriction throat comparing the ground-truth field, noisy",
  "experiments": "experiments in complex fluids, we first --- Page 12 --- 12 explore how differentiable solvers enable fitting models a handful of parameters, enabling us to efficiently fit an tobulkrheometerdata,inlinewithpreviousdata-driven ensemble of potential models to the same dataset. As- approaches to the same topic [26]. In particular, we as- suming that the errors in the fit are independent and sume that the Weissenberg number is small enough that normally distributed, the log-likelihood of the particular the flow in the rheometer gap becomes approximately estimate is given by two dimensional and spatially homogeneous. The",
  "results": "result isthatconstitutivelawscanbereducedtoordinarydiffer- Lˆ =−N (ln(2πL)+1), log-like ential equations only in terms of time that are expressed 2 termsoftherateofstraintensorDandthestressσ,with where L is the mean squared error defined in Eqn (34). no direct appearance of the flow u. The Bayesian information criterion for a particular fit to Under the quasi-two-dimensional flow assumption of a shear rheometer, the gradient of the flow ∇u = γ˙(t)e a model is then 12 only has one non-zero component in the shear direc- BIC=kln(N)−2Lˆ . (35) tioncharacterizedby apotentiallytime-dependent shear log-like rate γ˙, which is spatially homogeneous across the entire Here, k represents the number of parameters in the par- rheometer. Inashearrheometer,thisshearrateγ˙ maybe ticular model, which is given simply as the length of the prescribedandtheresultingshearstressσ measuredby 12 vector θ. Under a Bayesian framework, the model which averagingthetorsionalresistanceencounteredbythetop bestdescribesthesystemgiventheobserveddata hasthe plate. Alternatively, the shear stress may be prescribed smallest BIC, a measure which naturally penalizes more and the strain measured directly. We will use the former complicated models with higher degrees of freedom. case, though the approach would work equally well in the latter case. While the shear strain is assumed to be unidirectional, the stress σ has six independent compo- Model fitting protocol nents which can be non-zero due to non-linear coupling between the different stress terms in viscoelastic consti- We apply this approach by generating 100 random tutive laws. modelsforeachofNewtonian,Carreau-Yasuda,Oldroyd- Under our previous assumptions, for a particular con- B, Giesekus, and Linear PTT constitutive laws by ran- stitutive model we simulate the stress response to a par- domlysamplingmaterialparametersforeachmodel. The ticular strain rate γ˙ by integrating the model forward in exactrangesofmaterialparametersweusedforthissam- time to obtain all six stress terms for a given set of ma- ple are given in Table S1. We then generate a set of terial parameters. While this can be done for arbitrary groundtruthdataforeachmodelbysimulatingsynthetic choicesofmaterialparameters,wearemostinterestedin shear stress data under the forcing function using this framework to fit models to experimental data. In this case, most experimental data takes the form of a γ˙ =fsin(ωt) (36) measured shear stress, σˆ (t ), while the other five com- 12 n ponents of the ground truth are unknown. Here the t n for every combination of f ∈ [0.01,0.1,1.0,10.0] and arediscretemeasurementtimes. Thestandardlossfunc- ω ∈ [0.33,1.0,2.0]. We add Gaussian noise with an am- tion for fitting this data is the mean squared error or plitude of 0.03 onto the ground truth data to simulate experimental uncertainty. We fit this ground truth data 1 N L= ∑(σˆ (t )−σ (t ;θ))2, (34) back onto each of the five models, with initial guesses 12 n 12 n N n=1 of one for each material parameter. We used an ADAM where σ is our predicted shear stress and θ the vec- optimizer to perform the non-linear optimization with a 12 torofmaterialparametersthatdefinesthemodel. Thus, learningrateof0.1over1000epochs. Anexampleofthis fitting a given model to the data takes the form of a fitting process is shown in Fig. 5 for a set of Giesekus non-linear minimization problemover θ, where themini- ground truth data. mization must be performed through the solution to the WererantheCarreau-Yasudaparameteridentification ODE which governs σ for a given γ˙. tests on a new sample of 24 models with a learning rate 12 Weperformtheintegrationusingadifferentiablesolver of 0.001 and 50,000 epochs, which led to much better Diffrax [45], which allows us to automatically take gra- convergence onto the ground-truth parameters. dients of the loss function, Eqn (34), with respect to the parametersθ. Wecanusegradient-descentalgorithmsto efficiently find a set of parameters θ that best describe ACKNOWLEDGMENTS the data by minimizing the loss. This approach mirrors that used by neural network We thank Kaylie Hausknecht, Randy Ewoldt, Gareth data-driven approaches which rely on very large (on the McKinley,DaveWeitzandKaushikBhattacharyaforim- order over 1,000 to 10,000) numbers of parameters to fit portantdiscussions. ThisworkwassupportedbytheOf- the data, resulting in large computation times. We in- fice of Naval Research (ONR N00014-23-1-2654) and the stead fit the data to classical constitutive models, which NSF AI Institute of Dynamic Systems (2112085). --- Page 13 --- 13 [1] H.A.Barnes,inRheologyreviews(BritishSocietyofRhe- [31] M. Mahmoudabadbozchelou, K. M. Kamani, S. A. ology, 2003) pp. 1–62. Rogers, and S. Jamali, Proceedings of the National [2] P.R.DeSouzaMendesandR.L.Thompson,Journalof Academy of Sciences 121, 10.1073/pnas.2313658121 Non-Newtonian Fluid Mechanics 260, 104933 (2018). (2024). [3] R. B. Bird, R. C. Armstrong, and O. Hassager, Dynam- [32] S. Shanbhag and G. Erlebacher, Physics of Fluids 36 ics of polymeric liquids, Vol. 1: Fluid Mechanics (John (2024). Wiley & Sons, 1987). [33] T.Sato,S.Miyamoto,andS.Kato,JournalofRheology [4] P. J. Carreau, Transactions of the Society of Rheology 69, 15 (2025). 16, 99 (1972). [34] M.Raissi,P.Perdikaris,andG.E.Karniadakis,Journal [5] K. Yasuda, R. Armstrong, and R. Cohen, Rheologica of Computational physics 378, 686 (2019). Acta 20, 163 (1981). [35] A. M. Tartakovsky, C. O. Marrero, P. Perdikaris, G. D. [6] W. H. Herschel and R. Bulkley, Kolloid-Zeitschrift 39, Tartakovsky, and D. Barajas-Solano, Water Resources 291 (1926). Research 56, e2019WR026731 (2020). [7] J.Oldroyd,ProceedingsoftheRoyalSocietyA200,523 [36] B. Reyes, A. A. Howard, P. Perdikaris, and A. M. Tar- (1950). takovsky, Physical Review Fluids 6, 10.1103/physrevflu- [8] N. Phan-Thien and R. I. Tanner, Journal of Non- ids.6.073301 (2021). newtonian Fluid Mechanics 2, 353 (1977). [37] S. Thakur, M. Raissi, and A. Ardekani, Journal of Non- [9] H.Giesekus,JournalofNon-NewtonianFluidMechanics Newtonian Fluid Mechanics 325, 105100 (2024). 11, 69 (1982). [38] D. N. Simavilla, A. Bonfanti, I. Garc´ıa-Beristain, [10] J. Marchal and M. Crochet, Journal of Non-newtonian P. Espan˜ol, and M. Ellero, Journal of Fluid Mechanics Fluid Mechanics 26, 77 (1987). 1016, A11 (2025). [11] W. Lunsmann, L. Genieser, R. Armstrong, and [39] A. Kontogiannis, R. Hodgkinson, S. Reynolds, and R.Brown,Journalofnon-newtonianfluidmechanics48, E. Manchester, Journal of Fluid Mechanics (Rapids) 63 (1993). 1011, R3 (2025). [12] F. Debae, V. Legat, and M. Crochet, Journal of Non- [40] D. Kochkov, J. A. Smith, A. Alieva, Q. Wang, M. P. newtonian Fluid Mechanics 51, 257 (1994). Brenner, and S. Hoyer, Proceedings of the National [13] M. M. Denn, Annual Review of Fluid Mechanics 22, 13 Academy of Sciences 118, e2101784118 (2021). (1990). [41] M. G. Alhashim, K. Hausknecht, and M. P. Brenner, [14] J. Freund and R. Ewoldt, Journal of Rheology 59, 667 Proceedings of the National Academy of Sciences 122, (2015). e2403644122 (2025). [15] A. J. Liu and S. R. Nagel, Nature 396, 21 (1998). [42] J. Ling, A. Kurzawski, and J. Templeton, Journal of [16] P. Coussot, Soft Matter 3, 528 (2007). Fluid Mechanics 807, 155 (2016). [17] J. P. Rothstein and G. H. McKinley, Journal of Non- [43] J.Boyd,J.M.Buick,andS.Green,PhysicsofFluids19 Newtonian Fluid Mechanics 86, 61 (1999). (2007). [18] D.F.James,JournalofNon-NewtonianFluidMechanics [44] S. Lynch, N. Nama, and C. A. Figueroa, Scientific Re- 157, 91 (2009). ports 12, 20568 (2022). [19] L. Boyko, P. Abbasi, S. Movchan, G. D’Avino, [45] P. Kidger, On Neural Differential Equations, Ph.D. the- M.Manna,S.Haward,A.Shen,andV.Steinberg,Jour- sis, University of Oxford (2021). nal of Fluid Mechanics 908, A20 (2021). [20] E.J.Hinch,JournalofNon-NewtonianFluidMechanics 324, 105179 (2024). [21] J. M. Dealy, Journal of Rheology 39, 253 (1995). [22] R.H.Ewoldt,A.E.Hosoi,andG.H.McKinley,Journal of Rheology 52, 1427 (2008). [23] G.H.McKinleyandT.Sridhar,AnnualReviewofFluid Mechanics 34, 375 (2002). [24] C.J.Pipe,T.S.Majmudar,andG.H.McKinley,Rheo- logica Acta 48, 621 (2009). [25] S. J. Haward, M. S. N. Oliveira, M. A. Alves, and G. H. McKinley, Physical review letters 109, 128301 (2012). [26] K. Lennon, J. Rathinaraj, and J. Swan, Proceedings of the National Academy of Sciences 120, e2304669120 (2023). [27] M. Saadat, M. Mahmoudabadbozchelou, and S. Jamali, Rheologica Acta 61, 721–732 (2022). [28] D. Dabiri, M. Saadat, D. Mangal, and S. Jamali, Rheo- logica Acta 62, 557–568 (2023). [29] K. H. Ahn and S. Jamali, Rheologica Acta 62, 473–475 (2023). [30] M.MahmoudabadbozchelouandS.Jamali,ScientificRe- ports 11, 10.1038/s41598-021-91518-3 (2021). --- Page 14 --- 14 SUPPLEMENTARY INFORMATION 1. Effect of training data resolution and noise Experimental flow measurements are typically lower in resolution and contain structured uncertainty. To assess howsuchfactorsinfluencelearning,wesyntheticallydegradethetrainingdatatomimicmicro-PIVconditions(Meth- ods Sec. C). Specifically, the velocity field is down-sampled by Hann-windowed averaging over square interrogation windows of width W , and measurement noise ε is added according to the correlated, heteroskedastic model de- win scribed in the",
  "discussion": "DISCUSSION AND",
  "conclusion": "CONCLUSION late them into new analytical forms. Conversely, the samedifferentiableinfrastructurecanperforminversede- sign,optimizingmodelormaterialparameterstoachieve This work establishes a framework for learning consti- a target system behavior. tutivebehaviordirectlyfromflowmeasurementsthrough Together, these",
  "references": "reference data, and TBNN predictions before and after training. The trained model matches the ground-truth profile with minimal residual error despite noise. Note that values within the solid obstacle (where the velocity should be zero) are excluded from training but shown here for visual continuity. --- Page 18 --- 18 SUPPLEMENTARY TABLES TABLE S1. Parameter ranges and distributions for the random generation of ground truth models. For each parameter, we list the range of values and the distribution from which it is sampled. Model Parameter Range Distribution Newtonian Viscosity (η) [0.1, 10.0] Log Zero-shear viscosity (η ) [1.0, 100.0] Log 0 Infinite-shear viscosity (η ) [0.01, 0.1] Log ∞ Carreau-Yasuda Consistency index (k) [0.1, 10.0] Uniform Power-law index (n) [0.2, 0.7] Uniform Transition parameter (a) [0.5, 3.0] Uniform Polymer viscosity (η ) [1.0, 10.0] Uniform p Oldroyd-B Relaxation time (λ) [1.0, 10.0] Uniform Solvent viscosity (η ) [0.1, 10.0] Uniform s Polymer viscosity (η ) [0.1, 10.0] Log p Relaxation time (λ) [1.0, 10.0] Log Giesekus Solvent viscosity (η ) [0.1, 10.0] Log s Mobility factor (α) [0.01, 0.5] Uniform Polymer viscosity (η ) [0.1, 10.0] Log p Relaxation time (λ) [1.0, 10.0] Log Linear PTT Solvent viscosity (η ) [0.1, 10.0] Log s Elongational parameter (ζ) [0.01, 0.2] Uniform Mobility parameter (ϵ) [0.01, 0.5] Uniform"
}