{
  "abstract": "Abstract—With the increasing integration of intelligent driv- method is scenario-based testing in virtual environments. ingfunctionsintoserial-producedvehicles,ensuringtheirfunc- In [6] a scenario can be defined as temporal sequence tionality and robustness poses greater challenges. Compared of maneuvers and environmental elements, including traffic to traditional road testing, scenario-based virtual testing offers elements, natural elements, road elements, etc. Scenarios significant advantages in terms of time and cost efficiency, reproducibility, and exploration of edge cases. We propose are systematically designed to emulate real-world driving a Transformer-enhanced Conditional Variational Autoencoder conditions and can be customized with particular emphasis (CVAE-T)modelforgeneratingmulti-agenttrafficscenariosin on the trajectories and interactive behaviors of the traffic roundabouts,whicharecharacterizedbyhighvehicledynamics participants. In addition, scenario-based testing enables the and complex layouts, yet remain relatively underexplored in exploration of rare and safety-critical traffic situations that currentresearch.Theresultsshowthattheproposedmodelcan accuratelyreconstructoriginalscenariosandgeneraterealistic, are difficult to observe in real-world data [7]. diverse synthetic scenarios. Besides, two Key-Performance- The generation of scenarios consisting of single-agent Indicators (KPIs) are employed to evaluate the interactive trajectoryinrelativelysimpleroadlayouts,suchashighways, behavior in the generated scenarios. Analysis of the latent has been extensively studied. However, such approaches are spacerevealspartialdisentanglement,withseverallatentdimen- sions exhibiting distinct and interpretable effects on scenario insufficient for validating functions that involve interactions attributessuchasvehicleentrytiming,exittiming,andvelocity between multiple traffic participants, such as AEB, FCW profiles. The",
  "results": "result, small PET and minimum B. Key-Performance-Indicators TTC values are observed near the conflict zone. In contrast, Key-Performance-Indicators (KPIs) are commonly used in generated scenario 5(d) Vehicle 2 enters the roundabout to describe the dynamic relationship between two vehicles significantly later, while Vehicle 1 is already approaching and to classify the risk level of traffic situation based on PortBtoexit.ThisleadtoalargePETvalue,whileminimum --- Page 6 --- TTC is reached near Port B with small value. 25 20 15 10 5 0 0 5 10 15 20 25 PET (s) soiranecS fo rebmuN Original Scenarios Generated Scenarios (a) Distribution of PET in original and generated scenarios 25 20 15 10 5 0 0 5 10 15 20 25 PET (s) )s( CTT muminiM Thisdemonstratesthemodel’sstrongpotentialforgenerat- ing diverse scenarios, such as those involving different entry and exit timings or varying velocity profiles. V.",
  "introduction": "INTRODUCTION long-term trajectories and interactive behavior among agents Intelligent driving functions are shaping the automotive [8]. Realistic scenario generation that represents the spatio- industry. Functions like Adaptive Cruise Control (ACC) or temporal relationships between multiple agents remains a LaneKeepingAssistance(LKA)cantakethelongitudinalor significant challenge, particularly in complex intersections lateral control or both, thereby reducing driver workload and where high vehicle dynamics and diverse maneuver possi- improvingcomfort.Inordertoenhancethedrivingsafety,ac- bilities introduce substantial behavioral uncertainty. tivesafetysystemshavedemonstratedsignificantpotentialin Roundabouts, as a type of at-grade intersection, have mitigatingaccidentrisks[1].AutomatedEmergencyBraking beenwidelyimplementedworldwide,especiallyinEuropean (AEB)andFrontCollisionWarning(FCW)canreduceupto countries such as France and UK [9]. In roundabouts, vehi- 29% car crashes and 9% injuries. Lane Departure Warning clesalreadyinsidetypicallyhavetherightofway.Compared (LDW) has shown the capability to reduce crash rates by to vehicle maneuvers on highways, driving behavior within approximately 7% [2]. roundabouts is more complex. Entering and exiting a round- To ensure the reliability and robustness of these function- about often involves high acceleration or deceleration, along alities, comprehensive validation is required. Road testing with substantial steering input over a sustained duration due in real-world environments is a conventional approach [3]. to the curved geometry. However, it is time- and cost-intensive, particularly when In this paper, we propose a deep generative model attempting to accumulate the extensive mileage required for roundabout scenario generation using a Transformer- for safety validation [4]. Moreover, real-world testing poses enhancedConditionalVariationalAutoencoder(CVAE-T).In inherent safety risks to drivers due to the potential malfunc- Section III, we utilize the rounD dataset [10] to construct tioning of unproven systems [5]. An increasingly adopted scenariosbyextractingtrajectoriesoftwointeractingvehicles within a same temporal window. A Transformer-enhanced 1Teaching and Research Area for Mechatronics in Mobile Propulsion, CVAE model with variable β scheduling strategy is devel- RWTHAachenUniversity,Germany,{li_li,brinkmann,temmen,eisenbarth,  oped to capture the spatio-temporal patterns of the vehicles ©2025IEEE.Thisistheauthor’sversionofthepaperacceptedforpublicationinIEEEITSC2025. 5202 tcO 82 ]OR.sc[ 1v17642.0152:viXra --- Page 2 --- and their interaction. In Section IV, experimental",
  "methods": "METHODOLOGY A. Data Processing Vehicle 1 Vehicle 2 Original rounDdataset Vehicle 3 Padding VehicleS 1cenario 1 Paddi Pn ag dding Scenario Data𝑆12 pE on rt tr _y 1 PE on rt tr _y 2 PE orx ti _t 1 PE orx ti _t 2 Condition Data𝐶12 Vehicle 1 Padding Padding Vehicle 3 Padding 700frames … … elpmasenO S=(P )700 , P =(cid:0) xt,yt,xt,yt(cid:1) ∈R4 (1) t t=1 t 1 1 2 2 Each vehicle has four possible entry and four possible exit ports in the roundabout. Although some vehicles enter and exit at the same port or complete more than one full circle, these cases are rare and not representative of typical roundaboutbehavior.Therefore,thesescenariosareexcluded from this study. Each vehicle has 12 entry–exit possibilities. Categorical condition data C is derived from the entry–exit combinations of the two vehicles and the number of unique combinations is computed as: n(n+1) Number of condition categories= (2) 2 𝑺 where n = 12 and the total number of unique condition categories is 78, resulting in C ∈ {1,2,...,78}. The 𝑆12 scenario data are structured with shape (N, 700, 4) and Vehicle 2 the condition data have shape (N, 1), where N denotes the 𝐶12 number of samples. Categories with fewer than 300 samples 𝑆13 are excluded from the training process. As a",
  "conclusion": "CONCLUSION In this paper, we investigate multi-agent scenario gen- eration in roundabouts. The rounD dataset is selected and scenarios involving two interacting vehicles within the same temporalwindowareextracted.ACVAEisemployedtolearn the trajectories of the two vehicles and their interactions. To enhance the model’s ability to capture long-term spatio- temporal patterns, Transformer layers are integrated into the CVAE model. Theresultsdemonstratethattheproposedmodeliscapable Original Scenarios of reconstructing original scenarios and generating synthetic Generated Scenarios scenariosbasedongivenconditions.TwoKPIs,namelyTTC Scenario (a) Scenario (b) andPETareemployedtoevaluategenerationperformanceby Scenario (c) Scenario (d) comparing their distributions against those from the original dataset. Furthermore, the disentanglement and intuitiveness of the latent space are analyzed. Two latent dimensions are selected, each demonstrating a clear relationship with the vehicle’s velocity and roundabout entry timing, respectively. These findings highlight the ability of the proposed model to augment existing datasets with diverse and safety-relevant (b) Scatter plot of PET against minimum TTC in original and scenarios.Inparticular,itenablesthegenerationofcondition- generated scenarios specific scenarios tailored for the training and evaluation of intelligent driving functions such as AEB, FCW and CA. Fig. 6: Comparison of 500 original and 500 generated sce- While the proposed model is capable of generating most narios based on KPIs roundabout scenarios realistically, performance degrades in conditions with insufficient training samples. Moreover, the C. Latent Space Disentanglement and Interpretability proposedCVAE-Tmodelreliessolelyonpositiondata,which In roundabouts, the entry and exit timing as well as limits its ability to generate scenarios with smooth velocity velocity profiles of the interacting vehicles are key factors profiles. Future work will incorporate vehicle acceleration influencing the safety level of the scenarios. Therefore, we profiles, vehicle geometry and environmental elements, such investigate whether the proposed CVAE-T model captures asroadboundaries,toenablethegenerationofmorerealistic such parameters or other relevant parameters. We manually edge-case scenarios. vary one latent dimension from -3 to 3 in steps of 1.5, while keeping all other latent variables fixed at zero. Scenarios",
  "references": "REFERENCES are subsequently generated based on these controlled latent inputs. In addition, velocity profiles are computed from [1] M. Aleksa, A. Schaub, I. Erdelean, S. Wittmann, A. Soteropoulos, and A. Fürdös, “Impact analysis of advanced driver assistance sys- position data, excluding segments outside the roundabout. tems (adas) regarding road safety – computing reduction potentials,” Five latent parameters exhibit a distinct influence on EuropeanTransportResearchReview,vol.16,p.39,2024. the interactive behavior between the two vehicles in the [2] A.Benson,B.C.Tefft,A.M.Svancara,andW.J.Horrey,“Potential reductionsincrashes,injuries,anddeathsfromlarge-scaledeployment generated scenarios. Two representative latent parameters ofAdvancedDriverAssistanceSystems,”AAAFoundationforTraffic are here analyzed to explore their influence on scenario Safety,Tech.Rep.,2018,researchBrief. generation. Figure 7(a) illustrates the effect of varying the [3] P. Koopman and M. Wagner, “Challenges in autonomous vehicle 1th latent parameter from -3 to 3 (left to right). While the testing and validation,” SAE International Journal of Transportation Safety,vol.4,no.1,pp.15–24,2016. trajectory shape of Vehicle 1 remains relatively constant, [4] W.WachenfeldandH.Winner,“Thereleaseofautonomousvehicles,” its velocity profile changes noticeably, particularly at the inAutonomousDriving:TechnicalLegalandSocialAspects. Berlin, roundabout entry. In the first scenario, the velocity is steady, Heidelberg,Germany:SpringerBerlinHeidelberg,2016,pp.425–449. [5] H. Liu and Y. Feng, “Real world meets virtual world: Augmented whereas in the fifth, the vehicle decelerates before entering reality makes driverless vehicle testing faster, safer, and cheaper,” theroundaboutandacceleratesafterentry.Figure7(b)shows UniversityofMichigan,Tech.Rep.,2018. the effect of manipulating the 20th latent parameter. As its [6] S. Ulbrich, T. Menzel, A. Reschka, F. Schuldt, and M. Maurer, “Defining and substantiating the terms scene, situation, and scenario value increases, the entry timing of Vehicle 2 is delayed, for automated driving,” in 2015 IEEE 18th International Conference though the overall velocity profile remains similar. onIntelligentTransportationSystems,2015,pp.982–988. --- Page 7 --- 40 20 0 −20 −40 −40 −20 0 20 40 longitudinal position (m) )m( noitisop laretal z0=−3.00 Vehicle 1 Vehicle 2 Frame:114 20 10 0 0 50 100 150 200 Frame Index )s/m( yticoleV z0=−1.50 z0=0.00 z0=1.50 z0=3.00 40 V Ve eh hi ic cl le e 1 2 40 V Ve eh hi ic cl le e 1 2 40 V Ve eh hi ic cl le e 1 2 40 V Ve eh hi ic cl le e 1 2 200 Frame:117 Frame:117 Frame:116 Frame:116 20 20 20 20 150 0 0 0 0 100 −20 −20 −20 −20 50 −40 −40 −40 −40 0 −40 −20 0 20 40 −40 −20 0 20 40 −40 −20 0 20 40 −40 −20 0 20 40 longitudinal position (m) longitudinal position (m) longitudinal position (m) longitudinal position (m) 20 20 20 20 10 10 10 10 0 0 0 0 0 50 100 150 200 0 50 100 150 200 0 50 100 150 200 0 50 100 150 200 Frame Index Frame Index Frame Index Frame Index )1 elciheV( xednI emarF 200 150 100 50 0 )1 elciheV( xednI emarF Vehicle 1 Vehicle 2 (a) Variation of 1st latent parameter 40 20 0 −20 −40 −40 −20 0 20 40 longitudinal position (m) )m( noitisop laretal z19=−3.00 Vehicle 1 Vehicle 2 Frame:42 20 10 0 0 50 100 150 200 Frame Index )s/m( yticoleV z19=−1.50 z19=0.00 z19=1.50 z19=3.00 40 V Ve eh hi ic cl le e 1 2 40 V Ve eh hi ic cl le e 1 2 40 V Ve eh hi ic cl le e 1 2 40 V Ve eh hi ic cl le e 1 2 200 Frame:73 Frame:117 Frame:167 Frame:203 20 20 20 20 150 0 0 0 0 100 −20 −20 −20 −20 50 −40 −40 −40 −40 0 −40 −20 0 20 40 −40 −20 0 20 40 −40 −20 0 20 40 −40 −20 0 20 40 longitudinal position (m) longitudinal position (m) longitudinal position (m) longitudinal position (m) 20 20 20 20 10 10 10 10 0 0 0 0 0 50 100 150 200 0 50 100 150 200 0 50 100 150 200 0 50 100 150 200 Frame Index Frame Index Frame Index Frame Index )1 elciheV( xednI emarF 200 150 100 50 0 )1 elciheV( xednI emarF Vehicle 1 Vehicle 2 (b) Variation of 20th latent parameter Fig. 7: Influence of latent parameter variation on generated scenarios [7] J.Sun,H.Zhang,H.Zhou,R.Yu,andY.Tian,“Scenario-basedtest [18] D. P. Kingma and M. Welling, “Auto-encoding variational bayes,” automation for highly automated vehicles: A review and paving the arXiv preprint arXiv:1312.6114, 2014, presented at the International wayforsystematicsafetyassurance,”IEEETransactionsonIntelligent ConferenceonLearningRepresentations(ICLR). TransportationSystems,vol.23,no.9,pp.14088–14103,2022. [19] R. Krajewski, T. Moers, A. Meister, and L. Eckstein, “Béziervae: [8] D.Chen,M.Zhu,H.Yang,X.Wang,andY.Wang,“Data-driventraffic Improved trajectory modeling using variational autoencoders for the simulation:Acomprehensivereview,”IEEETransactionsonIntelligent safetyvalidationofhighlyautomatedvehicles,”in2019IEEEIntelli- Vehicles,vol.9,no.4,pp.4730–4748,2024. gentTransportationSystemsConference(ITSC),2019,pp.3788–3795. [9] W.Brilon,“Stateoftheartofroundaboutperformanceforpromoting [20] R. Jiao, X. Liu, B. Zheng, D. Liang, and Q. Zhu, “Tae: A semi- of urban safety,” Transport and Safety: Systems, Approaches, and supervisedcontrollablebehavior-awaretrajectorygeneratorandpredic- Implementation,pp.147–164,2021. tor,”inProc.IEEE/RSJInternationalConferenceonIntelligentRobots [10] R.Krajewski,T.Moers,J.Bock,L.Vater,andL.Eckstein,“Theround andSystems,2022,pp.12534–12541. dataset: A drone dataset of road user trajectories at roundabouts in [21] Y.SongandS.Ermon,“Generativemodelingbyestimatinggradients germany,”in2020IEEE23rdInternationalConferenceonIntelligent of the data distribution,” Advances in neural information processing TransportationSystems(ITSC),2020,pp.1–6. systems,vol.32,2019. [11] W. Zhan, L. Sun, D. Wang, H. Shi, A. Clausse, M. Naumann et al., [22] Z.Guo,Y.Yu,andC.Gou,“Controllablediffusionmodelsforsafety- “Interaction dataset: An international, adversarial and cooperative criticaldrivingscenariogeneration,”in2023IEEE35thInternational motion dataset in interactive driving scenarios with semantic maps,” Conference on Tools with Artificial Intelligence (ICTAI), 2023, pp. arXivpreprintarXiv:1910.03088,2019. 717–722. [12] X. Yan, Z. Zou, S. Feng, H. Zhu, H. Sun, and H. X. Liu, “Learn- [23] E. Pronovost, M. R. Ganesina, N. Hendy, Z. Wang, A. Morales, ing naturalistic driving environment with statistical realism,” Nature K. Wang et al., “Scenario diffusion: Controllable driving scenario communications,vol.14,no.1,p.2037,2023. generationwithdiffusion,”AdvancesinNeuralInformationProcessing [13] D. Nalic, T. Mihalj, M. Bäumler, M. Lehmann, A. Eichberger, and Systems,vol.36,pp.68873–68894,2023. S.Bernsteiner,“Scenariobasedtestingofautomateddrivingsystems: [24] M. Petrovich, M. J. Black, and G. Varol, “Action-conditioned 3d Aliteraturesurvey,”inFISITAwebCongress,vol.10,2020,p.1. humanmotionsynthesiswithtransformervae,”inProceedingsofthe [14] T. Menzel, G. Bagschik, L. Isensee, A. Schomburg, and M. Maurer, IEEE/CVF International Conference on Computer Vision, 2021, pp. “From functional to logical scenarios: Detailing a keyword-based 10985–10995. scenario description for execution in a simulation environment,” in [25] D. P. Kingma, S. Mohamed, D. Jimenez Rezende, and M. Welling, 2019 IEEE Intelligent Vehicles Symposium (IV). IEEE, 2019, pp. “Semi-supervisedlearningwithdeepgenerativemodels,”Advancesin 2383–2390. neuralinformationprocessingsystems,vol.27,2014. [15] I.J.Goodfellow,J.Pouget-Abadie,M.Mirza,B.Xu,D.Warde-Farley, [26] A. Vaswani, N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N. S. Ozair, A. Courville, and Y. Bengio, “Generative adversarial nets,” Gomez et al., “Attention is all you need,” Advances in neural infor- Advancesinneuralinformationprocessingsystems,vol.27,2014. mationprocessingsystems,vol.30,2017. [16] R. Krajewski, T. Moers, D. Nerger, and L. Eckstein, “Data-driven [27] T. Wang and X. Wan, “T-cvae: Transformer-based conditioned varia- maneuver modeling using generative adversarial networks and varia- tional autoencoder for story completion.” in IJCAI, 2019, pp. 5233– tionalautoencodersforsafetyvalidationofhighlyautomatedvehicles,” 5239. in 2018 21st International Conference on Intelligent Transportation [28] P.Shamsolmoali,M.Zareapoor,H.Zhou,X.Li,andY.Lu,“Distance- Systems(ITSC),2018,pp.2383–2390. based weighted transformer network for image completion,” Pattern Recognition,vol.147,p.110120,2024. [17] K.Zhang,C.Chang,W.Zhong,S.Li,Z.Li,andL.Li,“Asystematic [29] L. Li, Z. Zhang, Z.-G. Xu, W.-C. Yang, and Q.-C. Lu, “The role of solution of human driving behavior modeling and simulation for traffic conflicts in roundabout safety evaluation: A review,” Accident automated vehicle studies,” IEEE Transactions on Intelligent Trans- Analysis&Prevention,vol.196,p.107430,2024. portationSystems,vol.23,no.11,pp.21944–21958,2022."
}