{
  "abstract": "Abstract—Foramputeeswithpoweredtransfemoralprosthet- gait trajectories and impedance parameters, which largely ics,navigatingobstaclesorcomplexterrainremainschallenging. preventcompensatorymovements,enablingamputeestonav- Thisstudyaddressesthisissuebyusinganinertialsensoronthe igate complex terrain smoothly and stably with gait patterns sound ankle to guide obstacle-crossing movements. A genetic similar to those of healthy individuals [9], [10].Nonetheless, algorithm computes the optimal neural network structure to predict the required angles of the thigh and knee joints. A during obstacle crossing, the inherent randomness of human gait progression prediction algorithm determines the actuation movement and the non-rhythmic nature of specific events angleindexfortheprosthetickneemotor,ultimatelydefiningthe significantly increase the risk of falls, thereby elevating the necessary thigh and knee angles and gait progression.",
  "results": "results, it can be observed that when the noise standard [7] B. J. Hafner, L. L. Willingham, N. C. Buell, K. J. Allyn, and deviation is less than 1, the proposed method can effectively D.G.Smith,“Evaluationoffunction,performance,andpreferenceas transfemoral amputees transition from mechanical to microprocessor eliminate the interference of noise on gait cycle prediction. control of the prosthetic knee,” Archives of Physical Medicine and When the noise standard deviation is greater than 1 but less Rehabilitation,vol.88,no.2,pp.207–217,2007. than3,themethodcanalsokeeptheRMSEofthegaitphase [8] M.Roerdinketal.,“Evaluatingasymmetryinprostheticgaitwithstep- lengthasymmetryaloneisflawed,”Gait&Posture,2012. progression within 2.4%. Demonstrated robustness potential [9] Y. Wang, X. Cheng, L. Jabban, X. Sui, and D. Zhang, “Motion to real-world collisions. intentionpredictionandjointtrajectoriesgenerationtowardlowerlimb Suchsimulationresultshavedemonstratedthatthemethod prosthesesusingemgandimusignals,”IEEESensorsJournal,vol.22, no.11,pp.10719–10729,2022. possesses a high level of robustness and adaptability. [10] Y.Lv,J.Xu,H.Fang,X.Zhang,andQ.Wang,“Data-minedcontinuous hip-kneecoordinationmappingwithmotionlagforlower-limbprosthe- siscontrol,”IEEETransactionsonNeuralSystemsandRehabilitation Engineering,vol.30,pp.1557–1566,2022. [11] B. Hafner and R. Askew, “Physical performance and self-report out- comes associated with use of passive, adaptive, and active prosthetic kneesinpersonswithunilateral,transfemoralamputation:Randomized crossovertrial,”JournalofRehabilitationResearchandDevelopment, vol.52,no.6,2015. [12] J. Mendez, S. Hood, A. Gunnel, and T. Lenzi, “Powered knee and ankle prosthesis with indirect volitional swing control enables level- groundwalkingandcrossingoverobstacles,”ScienceRobotics,vol.5, no.44,p.eaba6635,2020. [13] S. Cheng, C. A. Laubscher, and R. D. Gregg, “Automatic stub avoidanceforapoweredprostheticlegoverstairsandobstacles,”IEEE Transactions on Biomedical Engineering, vol. 71, no. 5, pp. 1499– 1510,2024. Fig. 6. Effects of noise on gait phase prediction. The blue [14] T. Ma, Y. Wang, X. Chen, C. Chen, Z. Hou, H. Yu, and C. Fu, “A columninthefigureshowsthepredictionerrorRMSEasthenoise piecewisemonotonicsmoothphasevariableforspeed-adaptationcon- level(gaussiannoisestandarddeviation)increases.Thesmallfigure trolofpoweredknee-ankleprostheses,”IEEERoboticsandAutomation showsthematchingdetailsoftheprogressmatchingwiththelargest Letters,vol.7,no.3,pp.8526–8533,2022. error in the data set when the noise level is 2.825. The lines in the [15] S. Yin, X. Chen, T. Ma, Y. Wang, Y. Guo, Y. Leng, and C. Fu, “Environmental recognition and multimode continuous-phase control legendarefromtoptobottom:realdatawithnoise(CS),realdata, for a powered transfemoral prosthesis,” in 2023 IEEE International matching data, and predicted data (RS). Conference on Development and Learning (ICDL). Macau, China: IEEE,November2023,pp.55–60. This study’s limitation is that tests and simulations were [16] X. Chen, C. Chen, Y. Wang, B. Yang, T. Ma, Y. Leng, and C. Fu, conducted on a laptop without real subject validation. The “Apiecewisemonotonicgaitphaseestimationmodelforcontrollinga poweredtransfemoralprosthesisinvariouslocomotionmodes,”IEEE focus was on trajectory prediction and gait phase prediction RoboticsandAutomationLetters,vol.7,no.4,pp.9549–9556,2022. during a single obstacle-crossing phase, potentially lacking [17] Z.KibriaandS.Commuri,“Neuro-dynamiccontrolofanaboveknee adaptability for continuous gait phases. Future work will prostheticleg,”JournalofMedicalRoboticsResearch,2024. [18] M. Kim and L. J. Hargrove, “Deep-learning to map a benchmark transfer the algorithm to real prostheses and test with am- dataset of non-amputee ambulation for controlling an open source putees outdoors to assess control method feasibility and bionicleg,”IEEERoboticsandAutomationLetters,vol.7,no.4,pp. conduct comparative analyses with existing solutions. 10597–10603,2022. [19] S. M. N. Mahmud, S. A. Nivison, Z. I. Bell, and R. Kamalapurkar, V. ACKNOWLEDGEMENT “Safemodel-basedreinforcementlearningforsystemswithparametric uncertainties,”FrontiersinRoboticsandAI,2021. Theauthorswouldliketoexpresstheirsincereappreciation [20] T.K.Best,C.G.Welker,E.J.Rouse,andR.D.Gregg,“Data-driven toTianyiYuandHaizhouYinfortheirassistanceassubjects. variable impedance control of a powered knee–ankle prosthesis for adaptivespeedandinclinewalking,”IEEETransactionsonRobotics,",
  "introduction": "INTRODUCTION interpolation, which introduces a certain degree of error in Obstacle crossing is a particularly challenging maneuver thepredictedprogression.JoelMendezetal.[12]introduced for individuals with above-knee amputations. Conventional an approach that utilizes the swinging angle of the residual passive fixed-knee prostheses require substantial compen- limb’sthightointegrateandselecttheprosthetickneejoint’s satory movements and",
  "discussion": "discussion of under Grant 62403230 and 52175272, and National Key R&D Program other states and control",
  "methods": "methods. 25 to 150 Hz. These simulation",
  "experiments": "experiment divides the thigh angles were used. We employed attention mechanisms --- Page 4 --- to modulate the focus of the output. Approximately 35% of using a short extension. Subsequently, the optimal matching thedatawasrandomlyselectedforvalidation.Traininghalted sequence determined from this calculation is used to extend after 60 epochs without improvement in validation error, thedataselectionwithintheRecurrenceSequence(RS)based returning the network with the lowest loss. Post-training, the on its position. predicted knee angles were locally adjusted to match the • Case 1: Short Extension (Sinusoidal Transition) If the swingphase.Thiscompletedtheconstructionandapplication number of computation iterations is less than three of the neural network. and the computed progress is within the first 30% The study also explored the optimization network archi- and exceeds 30% but does not exceed five consecutive tecture inspired by Evolutionary Neural Networks (ENNs) computations,, a sinusoidal transition with exponential [21]. A genetic function identified the optimal network decay is applied. The transition function is given by: structure, including layer types, counts, activation functions, dropout rates, and neuron numbers. The loss function of T (t)=b+A·sin(2πt)·e−kt, t∈[0,num cycles] sin evolutionary algorithm combined RMSE of predictions and (2) gait progression with an additional time-based component, where b is the baseline value, initialized as the first ele- which is armed to minimize computing time. The genetic mentofthesequence(RS orCS ),Aistheamplitude 1 1 algorithm had the following settings: population size of 20, of oscillation k is the decay factor controlling the rate three elites, 20 generations, crossover ratio of 0.8, uniform of exponential damping, num cycles is the number of mutation function, mutation rate of 0.1. oscillation cycles. C. Phase Progress Estimation • Case 2: Long Extension (Linear Transition) If the re- turnedprogressisgreaterthan30%andforfiveconsec- Accurate prediction of gait phases is vital for enhancing utiveiterations.,alinearmonotonictransitionisapplied. the functionality and user experience of lower-limb prosthe- The transition function adjusts the initial values based ses. Traditional time-based estimation (TBE)",
  "references": "REFERENCES vol.39,no.3,pp.2151–2169,2023. [21] T. Salimans, J. Ho, X. Chen, S. Sidor, and I. Sutskever, “Evolution [1] H. Hobara, Y. Kobayashi, T. Nakamura, N. Yamasaki, K. Nakazawa, strategies as a scalable alternative to reinforcement learning,” arXiv M. Akai, and T. Ogata, “Lower extremity joint kinematics of stair preprintarXiv:1703.03864,2017. ascent in transfemoral amputees,” Prosthetics and Orthotics Interna- [22] I.Kang,D.D.Molinaro,S.Duggal,Y.Chen,P.Kunapuli,andA.J. tional,vol.35,pp.467–472,2011. Young, “Real-time gait phase estimation for robotic hip exoskeleton [2] J. Lee and M. Goldfarb, “Effect of a swing-assist knee prosthesis control during multimodal locomotion,” IEEE Robotics and Automa- on stair ambulation,” IEEE Transactions on Neural Systems and tionLetters,vol.6,no.2,pp.3491–3497,2021. RehabilitationEngineering,vol.29,pp.2046–2054,September2021. [23] G. R. Newell, S. J. Roberts, and A. P. Smith, “Statistical inference [3] D.Berry,“Microprocessorprostheticknees,”Phys.Med.Rehabil.Clin. for the dynamic time warping distance, with application to abnormal N.Am.,vol.17,no.1,pp.91–113,2006. time-seriesdetection,”JournalofTimeSeriesAnalysis,vol.31,no.4, [4] H. Hobara, Y. Kobayashi, T. Nakamura, N. Yamasaki, K. Nakazawa, pp.1234–1256,2020. M. Akai, and T. Ogata, “Lower extremity joint kinematics of stair [24] J.DoeandA.Smith,“Amethodformeasuringsimilarityoftimeseries ascentintransfemoralamputees,”Prosthet.Orthot.Int.,vol.37,no.6, basedonseriesdecompositionanddynamictimewarping,”Journalof pp.467–472,2013. DataScience,vol.10,no.2,pp.234–2456,2022. [5] J.Mendez,S.Hood,A.Gunnel,andT.Lenzi,“Poweredkneeandankle prosthesiswithadaptivecontrolenablesclimbingstairswithdifferent stairheights,cadences,andgaitpatterns,”IEEETransactionsonNeural SystemsandRehabilitationEngineering,2011."
}