{
  "introduction": "introduction of a vast The resulting optimal windows are summarized in rigidregion. WhenJ⊥islarge,feedforwardcouplingsyn- Fig. 9. All phase-diagram measurements in Fig. 2 and chronizes flips across layers; many avalanches that are Fig. 3 use these ∆t values. distinct within individual planes merge through the ver- w --- Page 12 --- 12 100.00 31.62 10.00 3.16 1.00 FIG. 9. The optimal temporal proximity windows ∆t for different parameter configurations. Each data point is obtained by w simulating the dynamics of 1 instance on a 64×64 lattice over 8000 time steps (T =8000∆t, ∆t=0.048γ1/3), extracting the avalanchesusing20differentvaluesof∆t andselectingtheonethatmaximizesthecorrelationlength. Wecanlooselyseethe w phase structures presented in Fig. 3. We also note a line of large ∆t at J⊥ =4, corresponding to the diverging average spin w flip time derived in Appendix A. tical links into a single 3D cluster that spans the stack. Consequently,power–lawregimesseenin2Darereplaced bydistributionsdominatedbysystem–wideeventsin3D. At intermediate couplings, two trends appear: For J⊥ ≲ 2, vertical links are too weak to fully synchronize layers. Avalanches remain predominantly lateral, and the 3D distributions recover a broad algebraic regime (LRO), similar to the in–plane case. For J⊥ > 2 but γ ∼ 1, memory weakens while vertical links are mod- erately strong; partial inter-layer merging also produces power-law distributions of avalanches corresponding to LRO. As γ increases further, activity becomes sparse, producing a crossover regime which eventually gives way to short–range behavior when γ is too large. Taken together, the 3D clusters make explicit the mechanism behind MILRO drag: vertical coupling links together correlated planes. When J⊥ is strong, this ef- fect yields stack–spanning events (rigidity); when mod- erate, it transmits order without full synchronization (LRO/crossover); and when weak, layers decouple and only small clusters survive. --- Page 13 --- 13 Rigid Long-range order Crossover Short-range correlations FIG. 10. Three-dimensional avalanche structure and phase map. Left: Phase diagram in the {γ,J⊥} plane when avalanches are defined with 3D nearest-neighbor connectivity in space (across (x,y,k)) and the temporal window ∆t . Colors denote w rigidity (stack-spanning avalanches), long-range order (LRO), a crossover regime, and short-range correlations. Compared to thein-planeanalysis,arigidregionnowexistsbecausestrongfeedforwardcouplingmergeslayer-by-layerburstsintosingle3D clusters. Right: Representative avalanche size distributions P(s) at the starred points {0.1,4.5} (rigid; dominated by system- wide events), {0.1,2.0} (LRO; broad power-law regime), and {1.0,2.0} (crossover; truncated tails). Increasing γ suppresses activity, while decreasing J⊥ reduces inter-layer merging, recovering LRO-like statistics. Each data point is obtained using 1 instance simulated over 8000 time steps on a 64×64 lattice.",
  "results": "results are typically robust over a w correspond to connected clusters in this 3D grid. finite range of this parameter. Here we describe our pro- Acrossallparametersetstested,thetwomethodsyield cedure for selecting ∆t w in a data-driven and physically almostidenticalpower–lawregimesandconsistentcutoffs motivated manner. within statistical error. However, explicit time binning Because memory evolves on the slow timescale 1/γ breakscontinuoustimetranslationinvarianceandcanin- and inter-layer transmission is controlled by J⊥, the op- troduceslightlydifferentpower-lawexponents,aswellas timal ∆t should be large enough to combine causally w artifacts near the tail. We therefore report all main text related flips within a burst, yet small enough to avoid resultsusingthemorephysicallyreasonableevent–linked merging distinct events. We therefore choose ∆t to w maximize an in-plane correlation length ξ(∆t ), defined w as the mean spatial separation of two events within the same avalanche (excluding system-spanning avalanches 4 As mentioned in Sec. III, the size of the LRO region in phase topreventatrivialdivergence). Thiscriterionfavorswin- space seems to saturate, persisting in the deepest layers simu- dows that preserve the largest coherent structures with- latedwhenγ<0.5andJ⊥>4. out over-aggregation. --- Page 11 --- 11 FIG. 8. Avalanche distributions over a variety of time windows. Avalanches are extracted at both {γ,J⊥} = {0.05,3.0} and {2.0,5.0} with a maximum of 75, 95, and 115 integration timesteps (in subplots a, b, and c, respectively) between successive flips in a single avalanche (the number of integration timesteps can be scaled by the simulation timestep dt to find ∆ in tw physical,simulationtime). Thisregionrepresentsaplateauin∆ -spaceatwhichdifferenttimewindowsyieldnearlyidentical tw distributions at both points in physical parameter space, suggesting the time window does not need to be fine-tuned to yield thedistributionsweobserve. Avalanchesareextractedover1000instances,eachsimulatedforT =200simulationtime(a.u.), on a 64×64 lattice. Figure 8 shows P(s) for several ∆t at {γ,J⊥} = Appendix D: Three–dimensional avalanche w {0.05,3.0} (a point in the LRO regime) and {2.0,5.0} (a structures point in the short-range correlated regime) on a 64×64 lattice. Onlyveryminorchangesarevisibleinthedistri- The analysis in the main text focused on in–plane butionsas∆t isvaried,suggestingthatabroadplateau w avalanches,i.e.,clustersbuiltfromnearest–neighborcon- of near-optimal windows yields indistinguishable power- nectivitywithinasinglelayer. Toprobeinter-layercorre- law regimes and essentially identical exponents. We ob- lations directly, we extend the definition of an avalanche servesimilarplateausatmanyotherpointsinparameter to three dimensions: two flip events are considered con- space. We use the maximizer of ξ(∆t ) within these w nected if they occur on nearest–neighbor sites in the full plateaus to select an “optimal” window ∆ . tw (x,y,k)latticeandwithinthetemporalwindow∆t (cf. w This optimal ∆t depends on {γ,J⊥}: faster mem- Appendix B). Therefore clusters may percolate both lat- w ory (γ large) typically favors smaller windows, whereas erally and across layers. stronger drag (J⊥ large) can tolerate slightly larger win- Fig. 10 shows the resulting {γ,J⊥} phase diagram to- dows due to tighter cross-layer coupling. For each pa- gether with representative distributions at three starred rameter pair we sweep ∆t over a wide range, identify w points: {0.1,4.5}(rigid),{0.1,2.0}(LRO),and{1.0,2.0} the maximizer of ξ(∆t ), and verify that the inferred w (crossover). Compared with the in–plane diagrams of exponent τ is stable across the plateau. Fig. 3, the main difference is the",
  "conclusion": "CONCLUSION boldt Stiftung through the Humboldt Research Award. M.D. suggested and supervised the work. Y.-H.Z. and We have shown that slow memory degrees of freedom C.S.contributedequallytothiswork. Y.-H.Z.performed can seed long-range order (LRO) in a locally coupled many numerical simulations, and C.S. the theoretical layer and, via purely local feedforward couplings, drag analysis and part of the numerical simulations. All au- this order into downstream layers that possess neither thors have read and contributed to the writing of the memory nor long-range interactions. Across a broad re- paper. --- Page 7 --- 7 [1] U. C. Ta¨uber, Critical dynamics: a field theory ap- [21] C. Li, L. Han, H. Jiang, M.-H. Jang, P. Lin, Q. Wu, proach to equilibrium and non-equilibrium scaling behav- M. Barnell, J. J. Yang, H. L. Xin, and Q. Xia, Three- ior (Cambridge University Press, 2014). dimensional crossbar arrays of self-rectifying si/sio2/si [2] G. Pruessner, Self-organised criticality: theory, mod- memristors, Nature communications 8, 15666 (2017). els and characterisation (Cambridge University Press, [22] D. B. Strukov and R. S. Williams, Four-dimensional ad- 2012). dress topology for circuits with stacked multilayer cross- [3] H. Hinrichsen, Non-equilibrium critical phenomena and bararrays,ProceedingsoftheNationalAcademyofSci- phase transitions into absorbing states, Advances in ences 106, 20155 (2009). physics 49, 815 (2000). [23] S. J. Kim, H.-J. Lee, C.-H. Lee, and H. W. Jang, 2d [4] C. Sipling, Y.-H. Zhang, and M. Di Ventra, Memory- materials-based 3d integration for neuromorphic hard- inducedlong-rangeorderindynamicalsystems,Physical ware, npj 2D Materials and Applications 8, 70 (2024). Review E 112, 014124 (2025). [24] G.BebisandM.Georgiopoulos,Feed-forwardneuralnet- [5] M. Weber, D. J. Luitz, and F. F. Assaad, Dissipation- works, Ieee Potentials 13, 27 (2002). induced order: the s= 1/2 quantum spin chain coupled [25] K.Christensen,Percolationtheory,ImperialCollegeLon- to an ohmic bath, Physical Review Letters 129, 056402 don 1, 87 (2002). (2022). [26] S. R. Bearden, F. Sheldon, and M. Di Ventra, Critical [6] Y.-H. Zhang, C. Sipling, E. Qiu, I. K. Schuller, and branching processes in digital memcomputing machines, M. Di Ventra, Collective dynamics and long-range order Europhysics Letters 127, 30005 (2019). in thermal neuristor networks, Nature Communications 15, 6986 (2024). [7] J.Sun,C.Sipling,Y.-H.Zhang,andM.DiVentra,Mem- Appendix A: Analytical Derivation of Average Spin ory in neural activity: long-range order without critical- Flipping Time ity, arXiv preprint arXiv:2409.16394 (2024). [8] M. Di Ventra, MemComputing: fundamentals and appli- cations (Oxford University Press, Oxford, 2022). To clarify the relevant timescales involved in our [9] C. Sipling, Y.-H. Zhang, and M. Di Ventra, Phase-space model,wewillexplicitlycalculatethetime∆toverwhich engineeringanddynamicallong-rangeorderinmemcom- a single spin s(k) flips, in both the base layer k = 0 and puting, arXiv preprint arXiv:2506.10149 (2025). i deeper layers k ≥ 1. We will assume that all neighbors [10] D. Ivanov, T. Y. Ivanova, S. Caballero-Benitez, and I.Mekhov,Feedback-inducedquantumphasetransitions of the flipping spin, s( jk) and s( ik−1), are constant over using weak measurements, Physical review letters 124, this time interval, and that s(k) changes approximately i 010603 (2020). linearly over this flipping interval. Furthermore, without [11] K. D. Harris and G. M. Shepherd, The neocortical cir- loss of generality, we will assume that s(0) flips from −1 cuit: themesandvariations,Natureneuroscience18,170 i (2015). to +1, so that ∆s(0) = 2. Note that the analysis would i [12] R.J.DouglasandK.A.Martin,Neuronalcircuitsofthe proceed identically, up to some factors of −1, if this flip neocortex, Annu. Rev. Neurosci. 27, 419 (2004). was from +1 to −1. [13] J.F.Mejias,J.D.Murray,H.Kennedy,andX.-J.Wang, First, since the change in a spin’s magnitude must be Feedforward and feedback frequency-dependent interac- 2, we can relate the flipping time ∆t to the derivative tionsinalarge-scalelaminarnetworkoftheprimatecor- s˙(k): tex, Science advances 2, e1601335 (2016). i [14] D.J.FellemanandD.C.VanEssen,Distributedhierar- chicalprocessingintheprimatecerebralcortex.,Cerebral cortex (New York, NY: 1991) 1, 1 (1991). s(k)(∆t)=s(k)(0)+s˙(k)·∆t =⇒ s˙(k)·∆t=2. (A1) i i i i [15] J.M.BeggsandD.Plenz,Neuronalavalanchesinneocor- tical circuits, Journal of neuroscience 23, 11167 (2003). From here, we can use the functional form for s˙(k), in [16] B. NarozhnyandA. Levchenko,Coulomb drag,Reviews i Eqn. 1, to estimate ∆t. We reiterate it here: of Modern Physics 88, 025003 (2016). [17] A.-P. Jauho and H. Smith, Coulomb drag between par- allel two-dimensional electron systems, Physical Review B 47, 4420 (1993). s˙(0) =(cid:88) J(0)s(0)−g(cid:88) x s(0), i ij j ij i [18] J.Li,T.Taniguchi,K.Watanabe,J.Hone,A.Levchenko, ⟨ij⟩ ⟨ij⟩ and C. Dean, Negative coulomb drag in double bilayer graphene, Physical review letters 117, 046802 (2016). s˙(k) =(cid:88) J(k)s(k)+J⊥(k)s(k−1) (k ≥1), (A2) i ij j i i [19] I.D’AmicoandG.Vignale,Theoryofspincoulombdrag ⟨ij⟩ in spin-polarized transport, Physical Review B 62, 4853 x˙ =γ(C −δ), C =(J(0)s(0)s(0)+1)/2. (2000). ij ij ij ij i j [20] C. P. Weber, N. Gedik, J. Moore, J. Orenstein, J. Stephens, and D. Awschalom, Observation of spin Letusconsiderthebaselayercase,k =0,first. There, coulomb drag in a two-dimensional electron gas, Nature thetwotypesofinteractionsaretheintra-layerspin-glass 437, 1330 (2005). interactions and the memory interactions. Since x and ij --- Page 8 --- 8 s(0) are both dynamical, we can estimate their contribu- where J ≡ (cid:80) J(k)s(k). As in the main text, the i 4 ⟨ij⟩ ij j tions to s˙(k) by taking the average value of their product four nearest-neighbor J(0)s(0)’s will each take values i ij j x ijs( i0): {−J,J}. Thus, J 4 ≡ (cid:80) ⟨ij⟩J i( j0)s( j0) will take the values {−4J,−2J,0,2J,4J}. In Fig. 5(a) we plot this flipping s˙(0) ≈(cid:88) J(0)s(0)−g(cid:88) x s(0). (A3) time ∆t for each of these five cases as a function of γ, i ij j ij i with g = 2, δ = 3/4, and J = 1 fixed. As expected, ∆t ⟨ij⟩ ⟨ij⟩ always decreases monotonically as a function of γ, since Sinces( ik) varieslinearlyintime(andwehaveassumed thefasterthememoryfrequencyγ,thefasters( ik) willbe all nearest-neighbors s to be fixed during this interval able to flip. All cases tend towards the power law decay j ofwidth∆t),x (t)willfollowsomeparabolictrajectory, ∆t∼γ−1/2 in the large-γ limit, when the memory inter- ij which can be solved for: actions will dominate and the strength of the spin-glass interactions becomes irrelevant. Cases where J <0 fol- 4 (cid:18) (cid:19) low ∆t ∼ 1/γ for smaller γ. This makes sense, as these γ 2 x˙ = J(0) t−1 s(0)−γ(δ−1/2), configurations would be stable in the absence of mem- ij 2 ij ∆t j ories, so the slowly-varying memories must oppose the (cid:90) (cid:32) γJ(0)s(0) (cid:18) J(0)s(0) (cid:19)(cid:33) spin-glass interactions for a longer duration before a flip =⇒ x ij = dt i ∆j tj t+γ − ij 2 j −δ∗ , can be completed. On the other hand, J 4 >0 cases tend towards constant ∆t at small γ, as these flips are almost γJ(0)s(0) (cid:32) γJ(0)s(0) (cid:33) entirely instigated by the spin-glass interactions them- = ij j t2+ − ij j −γδ∗ t+x (0), selves if γ is not too large. The boundary case, J = 0, 2∆t 2 ij 4 corresponds to a flip in s(0) leaving the energy of the i ≡αt2+βt+x (0). spin-glass configuration (ignoring the memory variables) ij (A4) unchanged. In this case, the solution to Eqn. A6 takes where δ∗ ≡ δ −1/2. Now that we have an expression the simple form for x (t), we can perform a simple integration to find ij x s(0): (cid:114) ij i 3 ∆t= . (A7) gγδ∗ 1 (cid:90) ∆t x s(0) = dtx s(0), ij i ∆t ij i We can take this one step further by averaging over 0 the entire lattice to find an average flipping time ⟨∆t⟩, 1 (cid:90) ∆t (cid:18) (cid:19)(cid:18) 2 (cid:19) = ∆t 0 dt αt2+βt+x ij(0) ∆tt−1 , c tio cn es .id Ae sri in ng tt hh eat mJ a4 inis teit xs te ,lf wa er wan ild lo dm rawvar ti ha eb fle ouo rn nt eh ae rela stt -- = 1 (cid:32) 2α (∆t)4+(cid:18) 2β − α(cid:19) (∆t)3 neighborJ i( j0)s( j0)’sfromtheuniformdistribution{−J,J} so that J takes the values {−4J,−2J,0,2J,4J} with ∆t 4∆t 3∆t 3 4 probabilities{1/16,4/16,6/16,4/16,1/16}. Thisenables (cid:18) 2x (0) β(cid:19) (cid:33) us to take the average value of any function of J which + ij − (∆t)2−x (0)(∆t) , 4 2∆t 2 ij appearsinthenumericalexpressionfor∆ttofindtheav- erage flipping time ⟨∆t⟩. See Fig. 6(a) for a plot of this α β = (∆t)2+ (∆t), average flipping time. Unsurprisingly, it is fitted well by 6 6 a polynomial decay which begins near ⟨∆t⟩ ∼ γ−1 for ∆t(cid:18)γJ(0)s(0) γJ(0)s(0) (cid:19) γδ∗∆t small γ and then gradually becomes more shallow until = ij j − ij j −γδ∗ =− , ⟨∆t⟩∼γ−1/2 for sufficiently large γ. 6 2 2 6 Thisprocedurecanalsobeappliedtootherlayerswith (A5) k ≥ 1. A similar expression to Eqn. A1 holds, but this giving us a more concrete expression for s˙(0) which now i time s˙(k) takes a different functional form: only depends on free parameters and ∆t. i WecannowwriteEqn.A1asaquadraticequationfor ∆t: s˙(k) =(cid:88) J(k)s(k)+J⊥(k)s(k−1). (A8) i ij j i i 2 =(cid:88)(cid:20) J(0)s(0)+ gγδ∗∆t(cid:21) , ⟨ij⟩ ∆t ij j 6 Again, we can now write an equation for ∆t: ⟨ij⟩ 2gγδ∗ =⇒ 0= 3 (∆t)2+J 4(∆t)−2, (A6) 2 =(cid:88) J(k)s(k)+J⊥(k)s(k−1) =⇒ ∆t= 2 , =⇒ ∆t= 3 (cid:18) −J +(cid:114) J2+ 16gγδ∗(cid:19) , ∆t ⟨ij⟩ ij j i i J 4+J 1⊥ 4gγδ∗ 4 4 3 (A9) --- Page 9 --- 9 FIG. 5. The flipping time ∆t over which a single spin s(k) flips, in both a) the base layer k = 0 and b) other layers k ≥ 1. i (cid:112) This timescale varies depending on the nature of the relevant spin-glass interactions. a) When J =0, ∆t= 3/gγδ∗. When 4 J <0, the flipping time decays as ∆t∼1/γ, until γ ∼O(1). When J >0, the flipping time remains constant at values near 4 4 1 for J =2J and 1/2 for J =4J, until γ ∼O(1). b) ∆t decays monotonically when both J >0 and J⊥ >0. Divergences 4 4 4 1 appear at J⊥ = 2J and J⊥ = 4J when the inter-layer and intra-layer spin-glass interactions are in opposition, and in these cases, flips can only occur within a particular range of J⊥. When J <0 and J⊥ <0, no flip will ever occur, so these curves 4 1 cannot be plotted. Parameters chosen: g=2, δ∗ ≡(δ−1/2)=1/4, J =1. FIG. 6. The average time ∆t over which a single spin s(k) flips, in both a) the base layer k = 0 and b) other layers k ≥ 1. i In both cases, all ⟨∆t⟩ shown in Fig. 5 are averaged according to the relative likelihood of occurrence, when both J(0)s(0) and ij i J⊥(k)s(k−1) aretakentobedrawnfromuniformdistributions{−J,J}and{−J⊥,J⊥},respectively. a)Thecurve⟨∆t⟩isfitted i i to a polynomial decay for γ ∈[10−2,10−1], yielding ∆t∼γ−0.96, and γ ∈[101,102], yielding ∆t∼γ−0.53. If this plot were to be extended, ⟨∆t⟩ would tend further towards ∆t∼γ−1 for lower γ and ∆t∼γ−1/2 for higher γ. Parameters chosen: g =2, δ∗ ≡(δ−1/2)=1/4, J =1. where J is defined as above and J⊥ ≡ J⊥(k)s(k−1) = ping only occurs in specific regimes. Divergences appear 4 1 i i {−J⊥,J⊥}, with probabilities {1/2,1/2}. We plot these at J⊥ = 2J and J⊥ = 4J, corresponding to transition flipping times as a function of J⊥ for each spin-glass pointsbeyondwhicheitherJ orJ⊥ becometooweakto 4 1 configuration in Fig. 5(b). We notice quickly that the initiate a flip. Interestingly, J⊥ =2J and J⊥ =4J both behavior of ∆t(J⊥) depends strongly on the relevant seem to correspond well with certain phase boundaries spin-glass configuration. Cases {J ,J⊥}={−4J,−J⊥}, in Fig. 3. When J⊥ < 2J, the inter-layer interaction 4 1 {−2J,−J⊥}, or {0,−J⊥} are not plotted, as no flips is consistently weaker than the intra-layer one, yielding would occur in any of these cases. When J and J⊥ are short-range effective interactions in layers k ≥1, regard- 4 1 insteadstrictlypositive,∆tdecaysmonotonically,andin lessofthememoryeffectinlayerk =0. WhenJ⊥ >4J, these cases, its value is dramatically lower than in the a flip in an adjacent layer will always induce a flip rela- base layer k = 0 for most values of γ. However, when tivelyquickly,enablingthecollectivestatetobedragged one of J and J⊥ is positive and one is negative, flip- 4 1 --- Page 10 --- 10 to arbitrarily an deep layer.4 algorithmandreservethebinned3Dpercolationmethod Lastly,wecantaketheaveragevalueoftheexpression for large sweeps where its lower complexity is advanta- in Eqn. A9, given all possible values of J and J⊥, to geous. SeeFig.7foracomparisonofthesetwoavalanche 4 1 produce an expression for ⟨∆t⟩. This average flipping extraction approaches. time ⟨∆t⟩ as a function of J⊥ is plotted in Fig. 6(b), with J =1 fixed. As expected, ⟨∆t⟩ is less than 1 when J⊥ is not too close to 2J or 4J, but near these values, the flipping timescale diverges. Appendix B: Numerical details We simulate Eqn. 1 on k square layers of size L×L stacked along the feedforward direction. Unless stated otherwise, open boundaries are used in-plane and all parameters are homogeneous within a layer. Time evolution is integrated with a fixed–step, fourth–order Runge–Kutta scheme using ∆t = 0.048γ1/3, which re- solves both the fast spin dynamics and the slow mem- ory dynamics over the range of γ explored. To elimi- nate transients, we discard the first 103 steps and record the subsequent trajectory for avalanche analysis. For each {γ,J⊥}, avalanches are collected over multiple dis- order realizations of {J(k),J⊥(k)} and independent ran- ij i dom seeds. Anavalanche isaconnectedburstofspinflipsinspace FIG. 7. Comparison of avalanche distributions extracted us- and time. We detect flips by monitoring sign changes of ing the event-linked algorithm (a) and the coarse-grained al- s(k)(t); each flip is stored with its lattice site and times- ternative (b). Both extraction procedures produce similar i phasestructure,includingbothfollowingpower-lawdistribu- tamp. Two flips are deemed connected if they occur on tions in the LRO regime (e.g., {γ,J⊥} = {0.05,3.0}) and nearest–neighbor sites and within a temporal proximity both only yielding small-scale avalanches in the short-range window ∆t w. We construct avalanches by recursively correlatedregime(e.g.,{γ,J⊥}={2.0,5.0}). Foreachdistri- merging connected flips (single–linkage clustering on the bution,1000instancesaresimulatedoverT =200simulation event graph). Avalanche size s is the number of flips in time (a.u.) on a 64×64 lattice, with ∆ /dt=75. tw thecluster. AlldistributionsinFigs.2and3areobtained with this event–linked procedure. The event–linked algorithm scales poorly at large L or when activity is dense, because the number of poten- Appendix C: Choosing the temporal proximity tial space–time links grows rapidly. For heavier work- window loads we therefore use a coarse–grained alternative: we discretize time into bins of width ∆t and mark a site w as “active” in bin n if at least one flip occurs at that Theavalanchedefinitioninvolvesasinglefreeparame- site in [n∆t w,(n+1)∆t w). This maps detection to a 3D ter, the temporal proximity window ∆t w. As with other (2D space + time) site–percolation problem with lattice commonavalanchedefinitions(e.g.,thresholdingorfixed- spacing (1,1,∆t ) and diagonal connections; avalanches time binning) [15, 26],"
}