{
  "abstract": "Abstract The cluster dose concept offers an alternative to the radiobiological effectiveness (RBE)- based model for describing radiation-induced biological effects. This study examines the application of a neural network to predict cluster dose distributions, with the goal of replacing the computationally intensive simulations currently required. Cluster dose distributions are predicted using a U-Net that was initially pretrained on conventional dose distributions. Using transfer learning techniques, the decoder path is adapted for cluster dose estimation. Both the training and pretraining datasets include head and neck regions from multiple patients and carbon ion beams of varying energies and positions. Monte Carlo (MC) simulations were used to generate the ground truth cluster dose distributions. The U-Net enables cluster dose estimation for a single pencil beam within milliseconds using a graphics processing unit (GPU). The predicted cluster dose distributions deviate from the ground truth by less than 0.35%. This proof-of-principle study demonstrates the feasibility of accurately estimating cluster doses within clinically acceptable computation times using machine learning (ML). By leveraging a pretrained neural network and applying transfer learning techniques, the approach significantly reduces the need for large-scale, computationally expensive training data. --- Page 2 ---",
  "introduction": "1. Introduction In ion beam therapy treatment planning, the biological effects of radiation are currently quantified by radiobiological effectiveness (RBE), defined as the ratio of the dose of radiation under consideration to the photon dose required to achieve the same biological outcome. The RBE strongly depends on the linear energy transfer (LET) of the radiation, which increases for carbon ions along their path and reaches its maximum in the Bragg peak region [1]. Treatment planning in carbon ion therapy accounts for this varying LET by optimizing the RBE-weighted dose, defined as the product of RBE and the absorbed physical dose [2]. Various semi-empirical models are used to determine the RBE, including the local effect model (LEM) [3–7] in Europe, the mixed-beam model [8,9], and the microdosimetric kinetic model (MKM) [10–13] in Japan. The RBEs calculated by the models differ by up to 15% from each other, and there is currently no consensus on which model provides the most accurate representation of RBE [14–16]. Faddegon et al. [17] introduced the cluster dose as an alternative method to the RBE- weighted dose. This concept uses the correlation between the biological effects of ionizing radiation and the spatial distribution of energy deposits with ionizations in biomolecules along the particle track [18]. Due to the small size of the targets (nanometer scale), the mean energy deposited is stochastic in nature and is described by the concepts of nanodosimetry [19]. Nanodosimetric quantities are modeled using track structure (TS) simulations. These Monte Carlo (MC) simulations utilize detailed cross-sections to determine energy depositions with nanometer-scale resolution. Detailed cross-section data are only available for a small selection of materials, which is why TS simulations are typically conducted in liquid water. In addition, the detailed simulations require significant computation time, making the simulation of macroscopic volumes practically infeasible [20,21]. The main (stochastic) physical quantity in nanodosimetry is the ionization cluster size (ICS) 𝜈, defined as the number of ionizations occurring within a target volume comparable in size to the desoxyribonucleic acid (DNA). The distribution of ICS is referred to as the ionization cluster size distribution (ICSD) 𝑃(𝜈), while the moments of the distribution are denoted as 𝑀 . In addition, the cumulative frequency of clusters with ICS greater than k 𝑖 ∞ 𝐹 = ∑𝑃(𝜈) 𝑘 (1) 𝜈=𝑘 is often specified [22,23]. The concept of cluster dose provides a",
  "methods": "Methods 2.1 Cluster Dose Calculation Model To predict cluster dose distributions, we employ a U-Net-based neural network that has been pretrained on dose distribution estimation. Cluster dose distributions are computed for a selection of the same patients and beam configurations used during pretraining, as well as for an additional patient case that was not included in the pretraining data. Section 2.2 provides details regarding the generation of the underlying training dataset. The architecture of the U-Net and the corresponding pretraining procedures are described in [33]. For a better understanding of the following description, an illustration of the U-Net architecture is attached in Supplementary Figure 1. The network receives two inputs: the patient’s mass density distribution and a cluster dose distribution in homogeneous water, precomputed for the same irradiation setup. The objective of the U- Net is to transform this distribution into a patient-specific cluster dose distribution. An advantage of this approach is that the model does not need to learn all of the underlying physical processes; instead, the training focuses on capturing the material dependence of these processes. Since the cluster dose distributions in water can be precomputed once for each beam configuration independently of the individual patient anatomy, this method eliminates the need for computationally intensive patient-specific computations during deployment. Features from the mass density distribution and the cluster dose distribution in water are extracted by two separate encoder pathways. After each encoder level, the extracted features are added. All layers in the pretrained encoders – except for the BatchNorm layers – are reused without further modification. This strategy is based on the assumption that features learned during dose prediction are also relevant for predicting cluster dose distributions. The BatchNorm layers are finetuned to adapt the normalization statistics to the distribution of the new training data. The decoder and bottleneck layers – which are responsible for the actual transformation – are also updated during training and optimized with respect to the new target distribution. The network is trained individually for each nanodosimetric quantity 𝐼 using the Adam 𝑃 optimizer with an initial learning rate of 10-4. The learning rate is progressively reduced during training via exponential decay with a decay rate of 0.93 (both inferred using hyperparameter optimization). As the loss function, the mean squared error (MSE) between the predicted and the real cluster dose distribution is employed. Training is terminated when the validation MSE has not improved for ten consecutive epochs. --- Page 5 --- 2.2 Dataset The dataset of cluster dose distributions is created using the simulation code described in [25]. The approach comprises two parts, as shown in Figure 1. First, a CH simulation of the carbon ion beam in the patient geometry to determine the cumulative track lengths 𝑡𝑐 in the voxels (described in Section 2.2.1). Second, a TS simulation of the carbon ions 𝑗 and their secondary particles at various energy levels to determine the nanodosimetric quantities 𝐼𝑐 (described in Section 2.2.2). 𝑃 Figure 1: The simulation used to determine the cluster dose distributions comprises a CH simulation to calculate the cumulative track length 𝑡𝑐 as a function of the particle class 𝑐 𝑗 (left), and a TS simulation to calculate the nanodosimetric quantities 𝐼𝑐 for all particle 𝑃 classes (right). In the CH simulation, the beam is modeled within the patient geometry, and the step lengths of the particles are scored in each voxel depending on particle type and energy. In the TS simulation, ionizations by these particles and the created secondary electrons are recorded and grouped into clusters by applying a spatial binning of the scoring volume. 2.2.1 Fluence Simulation The application for calculating cumulative track lengths is based on the simulation software Geant4 [34–36]. The simulation geometry is derived from CT images of the head and neck region of various patients, available in the GLIS-RT dataset from the Cancer Imaging Archive [34]. For the simulation of the beam in homogeneous water, the Hounsfield unit (HU) values of all voxels are set to 0 in a copy of a Digital Imaging and Communications in Medicine (DICOM) image from the dataset (which – according to the HU scale definition – corresponds to the material water). Using the Geant4 DICOM Reader [35], the CT images are converted into density distributions and into a voxelized geometry. Circular carbon ion beams with a diameter --- Page 6 --- of 1 mm and initial beam energies between 1250 MeV and 3000 MeV are simulated. The source position is randomly selected from the source positions used in the dose dataset [33]. For each patient and beam energy, four simulations with different random source positions are performed, resulting in 300 samples. The simulation uses the physical processes defined in the physics list of the hadron therapy example [36]. The cumulative track lengths are stored for each particle type in the form of a two-dimensional (2D) histogram. One dimension encodes the voxel index, and the other the energy bin of the particle. For each step of a particle in the geometry, the energy, the index of the voxel after the step, and the step length are determined, whereby the latter is added to the corresponding bin entry. Given that Geant4 treats a voxel boundary as a volume boundary, a step is recorded each time a voxel boundary is crossed. The particle types and energy bins considered were determined based on a preliminary simulation of the carbon ion beam at various energies in one of the patient geometries. The particle classes used distinguish the particle types C-12, C-11, C-10, B-11, B-10, protons, alpha, He-3, H-3, and H-2, as well as 84 energy bins between 1 MeV and 3000 MeV with increasing bin width.1 Due to the high memory requirements of the 2D histograms, the track length information is only stored within a lateral range of interest (ROI) of 16 ×16 voxels around the beam axis (for all planes in the beam direction). To scale the nanodosimetric quantities calculated in water, the ionization cross-sections for all materials and particle classes used are determined using the functions of the G4EmCalculator class. 2.2.2 TS Simulation and Clustering The nanodosimetric quantities are calculated using the MC TS software Geant4-DNA [37– 39]. The geometry comprises water, as the detailed TS cross-sections for most particles are only available for water. The scoring volume comprises a water cube with an edge length of 150 μm. This is embedded in a larger water cube with an edge length of 1 cm to account for potential backscattering processes. The CH cross-sections are used in this world volume, as detailed resolution is not required outside the scoring volume, which significantly reduces the simulation time. Electromagnetic processes are handled by the G4EmStandardPhysics_option4 constructor, while the TS region utilizes the processes from the G4EmDNAPhysics_option4 constructor. Hadronic processes are not considered here. They – along with the associated generation of secondary particles – are part of the CH simulation for determining the cumulative track lengths, whereas only the detailed spatial distribution of the particle ionizations is determined here. 1 Energy bin centers: [1, 2, 3, 4, 5, 10, 15, 20, 25, 30, 35, 40, 50, 60, 70, 80, 90, 100, 125, 150, 175, 200, 225, 250, 275, 300, 325, 350, 375, 400, 425, 450, 475, 500, 525, 550, 575, 600, 625, 650, 675, 700, 725, 750, 775, 800, 825, 850, 875, 900, 925, 950, 975, 1000, 1050, 1100, 1150, 1200, 1250, 1300, 1350, 1400, 1450, 1500, 1550, 1600, 1650, 1700, 1750, 1800, 1850, 1900, 1950, 2000, 2100, 2200, 2300, 2400, 2500, 2600, 2700, 2800, 2900, 3000] MeV. --- Page 7 --- The point-like source is positioned in the scoring volume at 0.5 μm from the edge, which enables scoring the energy depositions up to 0.5 μm behind the source. The primary particle of the simulation is stopped after 1 μm, and only secondary electrons and photons are tracked thereafter. For each ionization of a particle in the scoring volume, the position of the ionization and a unique number to identify the primary particle are recorded. The simulation is performed for all particle types considered in the fluence simulation, with the centers of the energy bins used as the initial energy. Each simulation includes 50.000 primary particles. The ionizations are clustered using the clustering approach described by Braunroth et al. [40], in which the scoring volume is conceptionally uniformly divided into cylindrical shell segments around the beam axis, each with the same volume. The cylindrical shell segments – as in Braunroth et al. [40] – have a height of 3.4 nm and a diameter of 2.3 nm. Based on the ionizations in a simulated track, the shell segments containing ionizations are determined, and the number of ionizations per primary particle is determined in each of these shell segments, which corresponds to the ICS. The resulting frequency distribution of targets with ionization clusters was determined per radial shell in Braunroth et al. [40] by repeating the procedure described for all simulated primary particle tracks and normalized by the number of primary particles. Here, a summation over all radial shells was applied, and the",
  "results": "results are not directly comparable to the data used in this study. However, while the accuracy of pencil beam algorithms is fundamentally constrained by their simplifying assumptions and cannot be further improved, the U-Net approach offers significant potential for improvement, particularly through expanding the training dataset. Instead of training the U-Net from scratch, this study utilized a pretrained model that had been trained on dose distributions. As numerous studies in this field have shown, such trained networks are increasingly available. Combining these models with transfer learning techniques enables a substantial reduction in the amount of training data required, while also saving computational resources and development time. Whether this approach can be transferred to other anatomical target regions and clinical scenarios remains the subject of future investigations. Particular attention should be devoted to increasing the variability in the training and test datasets; for example, by incorporating different anatomical regions, beam configurations, and clinical characteristics such as implants or pathological changes. A further point of interest is whether such specific configurations can be captured by cluster dose estimation models when they are already represented in the pretraining dose distributions. Since dose distributions can be generated much more efficiently than cluster dose data, creating a large and diverse dose dataset appears to be a practical and resource-efficient step toward improving the generalizability of such models. 5.",
  "discussion": "Discussion The calculation of cluster dose distributions is currently a computationally intensive process. The method presented in this work – which utilizes a U-Net to determine the cluster dose distribution – significantly reduces the computational effort: When using a GPU, the calculation time for a single cluster dose distribution is only (11.3 ± 0.2) ms, compared with (3.95 ± 0.14) s when using a CPU. This corresponds to an acceleration of approximately nine orders of magnitude with GPU usage and six orders of magnitude with CPU usage compared to conventional MC simulations. At the same time, cluster dose estimation using a U-Net model demonstrates high predictive accuracy, with a mean relative deviation of less than 0.4 % per image. Larger deviations are primarily observed in the Bragg peak region and in areas with steep density gradients, as Figure 3 illustrates. Such challenges in regions with abrupt density transitions have also been reported in the context of neural network–based dose calculations [33]. Figure 3 and Figure 4 illustrate that the general shape of the cluster dose distribution is reliably reconstructed. The position of the Bragg peak perpendicular to the beam axis is correctly predicted in most cases, whereas only in a few cases is the predicted peak located in a neighboring voxel. With respect to the depth of the Bragg peak – expressed as the position of the distal 90 % fall-off – maximum deviations of up to nine voxels were observed. These deviations are symmetrically distributed around zero deviation, with a few outliers at lower depths. In contrast, the height of the Bragg peak is systematically and significantly underestimated, as clearly shown in Figure 4(c). The plateau region is also underestimated, as illustrated by the examples in Figure 3. The models differ in their accuracy in predicting the width of the Bragg peak: while the gF2 model shows only minor deviations of up to about 10 voxels in the FWHM of the Bragg peak, the other models exhibit considerably larger outliers. In all cases, the width is both under- and overestimated to a similar extent. The computation time for generating the cluster dose distribution with a pencil beam algorithm for a prostate cancer patient was reported to range between 114 s and 1719 s for a carbon ion radiation field [26]. While our reported computation times refer to a single pencil beam, the values from the literature correspond to complete radiation fields, which generally comprise approximately 10⁴ pencil beams. Consequently, the total --- Page 13 --- computation time of the U-Net is in a comparable range to that of the pencil beam algorithm. However, since the U-Net approach is technically straightforward to parallelize, there is potential for substantial reduction in computation time when applied to full radiation fields. A comparison of the algorithm’s accuracy is not possible, as the published",
  "conclusion": "Conclusion This proof-of-principle study demonstrates that the computationally intensive MC simulations used for cluster dose calculations can be replaced by a neural network approach. Instead of training from scratch, transfer learning from pretrained dose prediction networks can be employed, significantly reducing the amount of training data that must be generated. The U-Net model used in this work enables cluster dose estimation for a single pencil beam within milliseconds to a few seconds, while maintaining high accuracy. Future studies should investigate the generalizability of this approach to other anatomical regions and treatment modalities, particularly with more extensive and diverse training datasets. 6. Acknowledgments This work was in part supported by the “Metrology for Artificial Intelligence in Medicine (M4AIM)” program, funded by the German Federal Ministry of Economic Affairs and Climate Action in the frame of the QI-Digital Initiative. 7. Data Availability Statement The data that support the findings of this study are openly available at the following URL/DOI:  --- Page 14 ---",
  "references": "References [1] Mohamad O, Sishc B J, Saha J, Pompos A, Rahimi A, Story M D, Davis A J and Kim D W N 2017 Carbon Ion Radiotherapy: A Review of Clinical Experiences and Preclinical Research, with an Emphasis on DNA Damage/Repair Cancers (Basel) 9 66 [2] Schulz-Ertner D, Jäkel O and Schlegel W 2006 Radiation Therapy With Charged Particles Seminars in Radiation Oncology 16 249–59 [3] Scholz M, Kellerer A M, Kraft-Weyrather W and Kraft G 1997 Computation of cell survival in heavy ion beams for therapy Radiat Environ Biophys 36 59–66 [4] Krämer M and Scholz M 2000 Treatment planning for heavy-ion radiotherapy: calculation and optimization of biologically effective dose Phys. Med. Biol. 45 3319–30 [5] Elsässer Th and Scholz M 2006 Improvement of the local effect model (LEM)—implications of clustered DNA damage Radiation Protection Dosimetry 122 475–7 [6] Elsässer T and Scholz M 2007 Cluster Effects within the Local Effect Model Radiation Research 167 319–29 [7] Krämer M, Weyrather W K and Scholz M 2003 The Increased Biological Effectiveness of Heavy Charged Particles: From Radiobiology to Treatment Planning Technology in Cancer Research & Treatment [8] Kanai T, Endo M, Minohara S, Miyahara N, Koyama-ito H, Tomura H, Matsufuji N, Futami Y, Fukumura A, Hiraoka T, Furusawa Y, Ando K, Suzuki M, Soga F and Kawachi K 1999 Biophysical characteristics of HIMAC clinical irradiation system for heavy-ion radiation therapy International Journal of Radiation Oncology*Biology*Physics 44 201–10 [9] Kanai T, Furusawa Y, Fukutsu K, Itsukaichi H, Eguchi-Kasai K and Ohara H 1997 Irradiation of Mixed Beam and Design of Spread-Out Bragg Peak for Heavy-Ion Radiotherapy Radiation Research 147 78–85 [10] Inaniwa T, Kanematsu N, Matsufuji N, Kanai T, Shirai T, Noda K, Tsuji H, Kamada T and Tsujii H 2015 Reformulation of a clinical-dose system for carbon-ion radiotherapy treatment planning at the National Institute of Radiological Sciences, Japan Phys. Med. Biol. 60 3271– 86 [11] Inaniwa T, Furukawa T, Kase Y, Matsufuji N, Toshito T, Matsumoto Y, Furusawa Y and Noda K 2010 Treatment planning for a scanned carbon beam with a modified microdosimetric kinetic model Phys. Med. Biol. 55 6721 [12] Kase Y, Kanai T, Matsumoto Y, Furusawa Y, Okamoto H, Asaba T, Sakama M and Shinoda H 2006 Microdosimetric Measurements and Estimation of Human Cell Survival for Heavy-Ion Beams Radiation Research 166 629–38 [13] Hawkins R B 1998 A microdosimetric-kinetic theory of the dependence of the RBE for cell death on LET Medical Physics 25 1157–70 [14] Fossati P, Molinelli S, Matsufuji N, Ciocca M, Mirandola A, Mairani A, Mizoe J, Hasegawa A, Imai R, Kamada T, Orecchia R and Tsujii H 2012 Dose prescription in carbon ion --- Page 15 --- radiotherapy: a planning study to compare NIRS and LEM approaches with a clinically- oriented strategy Phys. Med. Biol. 57 7543 [15] Steinsträter O, Grün R, Scholz U, Friedrich T, Durante M and Scholz M 2012 Mapping of RBE- Weighted Doses Between HIMAC– and LEM–Based Treatment Planning Systems for Carbon Ion Therapy International Journal of Radiation Oncology*Biology*Physics 84 854–60 [16] Molinelli S, Magro G, Mairani A, Matsufuji N, Kanematsu N, Inaniwa T, Mirandola A, Russo S, Mastella E, Hasegawa A, Tsuji H, Yamada S, Vischioni B, Vitolo V, Ferrari A, Ciocca M, Kamada T, Tsujii H, Orecchia R and Fossati P 2016 Dose prescription in carbon ion radiotherapy: How to compare two different RBE-weighted dose calculation systems Radiotherapy and Oncology 120 307–12 [17] Faddegon B, Blakely E A, Burigo L, Censor Y, Dokic I, Domínguez Kondo N, Ortiz R, Ramos Méndez J, Rucinski A, Schubert K, Wahl N and Schulte R 2023 Ionization detail parameters and cluster dose: a mathematical model for selection of nanodosimetric quantities for use in treatment planning in charged particle radiotherapy Phys. Med. Biol. 68 175013 [18] Goodhead D T 1994 Initial Events in the Cellular Effects of Ionizing Radiations: Clustered Damage in DNA International Journal of Radiation Biology 65 7–17 [19] Amols H I, Wuu C S and Zaider M 1990 On Possible Limitations of Experimental Nanodosimetry Radiation Protection Dosimetry 31 125–8 [20] Nikjoo H, Uehara S, Emfietzoglou D and Cucinotta F A 2006 Track-structure codes in radiation research Radiation Measurements 41 1052–74 [21] Dingfelder M 2012 Track-structure Simulations for Charged Particles Health Physics 103 590 [22] Grosswendt B, Pszona S and Bantsar A 2007 New descriptors of radiation quality based on nanodosimetry, a first approach Radiation Protection Dosimetry 126 432–44 [23] Palmans H, Rabus H, Belchior A L, Bug M U, Galer S, Giesen U, Gonon G, Gruel G, Hilgers G, Moro D, Nettelbeck H, Pinto M, Pola A, Pszona S, Schettino G, Sharpe P H G, Teles P, Villagrasa C and Wilkens J J 2015 Future development of biologically relevant dosimetry Br J Radiol 88 20140392 [24] Rabus H and Thomas L 2024 On a revised concept of an event that allows linking microdosimetry in nanometric sites and nanodosimetry with macroscopic dosimetry arXiv:2412.00904 [physics.med-ph] [25] Schwarze M, Looe H K, Poppe B, Thomas L and Rabus H 2025 Cross-Section-Based Scaling Method for Material-Specific Cluster Dose Calculations -- A Proof of Concept [26] Facchiano S, Ortiz R, Cristoforetti R, D-Kondo N, Jaekel O, Faddegon B and Wahl N 2025 An ion treatment planning framework for inclusion of nanodosimetric ionization detail through cluster dose [27] Zhang H, Li Q, Liu X, Ma Y, He P, Shen G, Li Z, Chen W, Niu R, Dai Z and Xiao G 2022 Validation and testing of a novel pencil-beam model derived from Monte Carlo simulations in carbon-ion treatment planning for different scenarios Physica Medica 99 1–9 --- Page 16 --- [28] Ruangchan S, Palmans H, Knäusl B, Georg D and Clausen M 2021 Dose calculation accuracy in particle therapy: Comparing carbon ions with protons Med Phys 48 7333–45 [29] Pastor-Serrano O and Perkó Z 2022 Millisecond speed deep learning based proton dose calculation with Monte Carlo accuracy Phys. Med. Biol. 67 105006 [30] Mentzel F, Kröninger K, Lerch M, Nackenhorst O, Paino J, Rosenfeld A, Saraswati A, Tsoi A C, Weingarten J, Hagenbuchner M and Guatelli S 2022 Fast and accurate dose predictions for novel radiotherapy treatments in heterogeneous phantoms using conditional 3D-UNet generative adversarial networks Medical Physics 49 3389–404 [31] Mentzel F, Kröninger K, Lerch M, Nackenhorst O, Rosenfeld A, Tsoi A C, Weingarten J, Hagenbuchner M and Guatelli S 2022 Small beams, fast predictions: a comparison of machine learning dose prediction models for proton minibeam therapy Medical Physics 49 7791–801 [32] Mentzel F, Paino J, Barnes M, Cameron M, Corde S, Engels E, Kröninger K, Lerch M, Nackenhorst O, Rosenfeld A, Tehei M, Tsoi A C, Vogel S, Weingarten J, Hagenbuchner M and Guatelli S 2022 Accurate and fast deep learning dose prediction for a preclinical microbeam radiation therapy study using low-statistics Monte Carlo simulations [33] Schwarze M, Looe H K, Poppe B, Tappayuthpijarn P, Thomas L and Rabus H 2025 Exploring Machine Learning Models for Physical Dose Calculation in Carbon Ion Therapy Using Heterogeneous Imaging Data - A Proof of Concept Study [34] Shusharina N and Bortfeld T 2021 Glioma Image Segmentation for Radiotherapy: RT targets, barriers to cancer spread, and organs at risk (GLIS-RT) [35] Anon 2024 examples/extended/medical/DICOM2 · master · geant4 / geant4 · GitLab GitLab [36] Anon 2024 examples/advanced/hadrontherapy · master · geant4 / geant4 · GitLab GitLab [37] Incerti S, Baldacchino G, Bernal M, Capra R, Champion C, Francis Z, Guatelli S, Guèye P, Mantero A, Mascialino B, Moretto P, Nieminen P, Rosenfeld A, Villagrasa C and Zacharatou C 2010 The Geant4-DNA project Int. J. Model. Simul. Sci. Comput. 1 157–78 [38] Incerti S, Ivanchenko A, Karamitros M, Mantero A, Moretto P, Tran H N, Mascialino B, Champion C, Ivanchenko V N, Bernal M A, Francis Z, Villagrasa C, Baldacchino G, Guèye P, Capra R, Nieminen P and Zacharatou C 2010 Comparison of GEANT4 very low energy cross section models with experimental data in water Med. Phys. 37 4692–708 [39] Incerti S, Kyriakou I, Bernal M A, Bordage M C, Francis Z, Guatelli S, Ivanchenko V, Karamitros M, Lampe N, Lee S B, Meylan S, Min C H, Shin W G, Nieminen P, Sakata D, Tang N, Villagrasa C, Tran H N and Brown J M C 2018 Geant4‐DNA example applications for track structure simulations in liquid water: A report from the Geant4‐DNA Project Med. Phys. 45 e722–39 [40] Braunroth T, Nettelbeck H, Ngcezu S A and Rabus H 2020 Three-dimensional nanodosimetric characterisation of proton track structure Radiat. Phys. Chem. 176 109066 [41] Ramos-Méndez J, Burigo L N, Schulte R, Chuang C and Faddegon B 2018 Fast calculation of nanodosimetric quantities in treatment planning of proton and ion therapy Phys. Med. Biol. 63 235015 --- Page 17 --- [42] Lowekamp B C, Chen D T, Ibáñez L and Blezek D 2013 The Design of SimpleITK Front Neuroinform 7 45 [43] Yaniv Z, Lowekamp B C, Johnson H J and Beare R 2018 SimpleITK Image-Analysis Notebooks: a Collaborative Environment for Education and Reproducible Research J Digit Imaging 31 290–303 [44] Anon ROOT — An object oriented data analysis framework - ScienceDirect --- Page 18 --- Supplementary Figures Supplementary Figure 1: Architecture of the dose prediction U-Net used for transfer learning [33]."
}