{
  "abstract": "Abstract Theinversesourceproblemarisinginphotoacoustictomographyandinseveralothercoupled- physics modalities is frequently solved by iterative algorithms. Such algorithms are based on the minimization of a certain cost functional. In addition, novel deep learning techniques are currently being investigated to further improve such optimization approaches. All such",
  "methods": "Methods in Imaging, Springer New York, New York, NY, 2011, pp. 817–865. [36] L. Kunyansky, Fast reconstruction algorithms for the thermoacoustic tomography in certain domains with cylindrical or spherical symmetries, Inverse Probl. Imaging, 6 (2012), pp. 111–131. [37] , A mathematical model and inversion procedure for magneto-acousto-electric tomography (maet), Inverse Problems, 28 (2012), p. 035002. [38] L. A. Kunyansky, Explicit inversion formulae for the spherical mean radon transform, Inverse Problems, 23 (2007), pp. 373–383. [39] S. Lunz, A. Hauptmann, T. Tarvainen, C.-B. Schonlieb, and S. Arridge, On learned operatorcorrectionininverseproblems,SIAMJournalonImagingSciences,14(2021),pp.92–127. [40] F. Natterer, The Mathematics of Computerized Tomography, vol. 32, SIAM, 2nd ed., 2001. [41] L. V. Nguyen, A family of inversion formulas in thermoacoustic tomography, Inverse Problems and Imaging, 3 (2009), pp. 649–675. [42] , A family of inversion formulas in thermoacoustic tomography, Inverse Problems and Imag- ing, 3 (2009), pp. 649–657. 23 --- Page 24 --- [43] S. J. Norton, Reconstruction of a two-dimensional reflecting medium over a circular domain: exact solution, J. Acoust. Soc. Am., 67 (1980), pp. 1266–73. [44] F. W. J. Olver, D. W. Lozier, R. F. Boisvert, and C. W. Clark,eds.,NIST Handbook of Mathematical Functions, U.S. Department of Commerce, NIST and Cambridge University Press, Cambridge, 2010. [45] A. A. Oraevsky, S. L. Jacques, R. O. Esenaliev, and F. K. Tittel, Laser-based optoa- coustic imaging in biological tissues, in Proc. SPIE, vol. 2134A, 1994, pp. 122–128. [46] V. P. Palamodov, A uniform reconstruction formula in integral geometry, InverseProblems, 28 (2012), p. 065014. [47] J. Rauch, Partial Differential Equations, Springer, 2012. [48] P. Stefanov and G. Uhlmann, Thermoacoustic tomography with variable sound speed, Inverse Problems, 25 (2009), p. 075011. [49] B. E. Treeby and B. T. Cox, K-wave: Matlab toolbox for the simulation and reconstruction of photoacoustic wave fields, J. Biomed. Opt., 15 (2010), p. 021314. [50] M. Xu and L. V. Wang, Time-domain reconstruction for thermoacoustic tomography in a spherical geometry, IEEE Transactions on Medical Imaging, 21 (2002), pp. 814–822. [51] , Universal back-projection algorithm for photoacoustic computed tomography, Phys. Rev. E, 71 (2005), p. 016706. [52] C. Yang, H. Lan, F. Gao, and F. Gao, Review of deep learning for photoacoustic imaging, Photoacoustics, 21 (2021), p. 100215. 24",
  "introduction": "1 Introduction Imagereconstructioninalargenumberofnovelcoupled-physics(orhybrid)imagingmodalitiesinvolves a certain wave operator. For example, two of the most developed hybrid modalities are photoacoustic and thermoacoustic tomography (PAT [31,45] and TAT [32]). In PAT and TAT such a wave operator describes propagation of the acoustic wave generated by an instantaneous thermoelastic expansion of tissues induced by a short pulse of infrared or microwave radiation. The acoustic wave in this case is a solution of the Cauchy problem for the wave equation in Rd: ∂2 p(t,x)=c2∆p(t,x), t≥0, x∈Rd, (1) ∂t2 ∂ p(0,x)=f(x), p(0,x)=0, (2) ∂t where p(t,x) is the excess acoustic pressure, c is the known and constant speed of sound, and function f(x) represents the initial pressure due to thermoelastic expansion. The initial pressure f is assumed to be compactly supported within a region Ω that is a subset of a convex domain Ω with a smooth 0 boundary ∂Ω. The trace g(t,z) of the pressure is measured during the time interval t∈(0,T] by a set of transducers that cover a subset Γ⊂∂Ω of the boundary: g(t,z)=p(t,z), (t,z)∈(0,T]×Γ. This defines the wave operator A: A:f (cid:55)→g. QuestionsabouttheinjectivityandinvertibilityofA[12,13,35,48],aswellasthedesignofinversion algorithms have received a lot of attention over the last two decades [9,10,12,13,18,36,38,41,43,46, ∗Research Unit of Mathematical Sciences, University of Oulu, Oulu, Finland and the Department of Computer Science,UniversityCollegeLondon,London,U.K. †DepartmentofMathematics,UniversityofArizona,Tucson,USA ‡DepartmentofTechnicalPhysics,UniversityofEasternFinland,Kuopio,Finland 1 5202 tcO 82 ]VI.ssee[ 1v78642.0152:viXra --- Page 2 --- MSOT InVision 256-TF 256-element detector array Imaging target Illumination Figure 1: Illustration of photoacoustic system MSOT inVision by iThera Medical with the data ac- quired by a ring of transducers. 50,51]. In the simplest cases (for example, when Γ is a circle or a sphere completely surrounding the supportoff)theoperatorAisstablyinvertible,thereareexplicitformulasforA−1[12,13,38,43,50,51], and efficient computational algorithms have been developed [16,17,21,36,43,50,51] to compute A−1g and, thus, to reconstruct the sought initial condition f. However, in more complex cases involving limited-view geometries or the measurements affected by high level of noise, approximations to f(x) are often computed with variational",
  "results": "result in a fast algorithm. Starting with the Fourier transform representation of G(t,x) (equation (23)), one obtains for the normal derivative ∂ G(t,x−z) the following expression: ∂n(z) (cid:20) (cid:18) (cid:19)(cid:21) ∂ sin|ξ|t G(t,x−z)=zˆ(θ)·∇ G(t,x−z)=zˆ(θ)·∇ F−1 (t,x−z) ∂n(z) z z 2D |ξ|   1 (cid:90) sin|ξ|t i (cid:90) sin|ξ|t = 2πzˆ(θ)·∇ z |ξ| eiξ·(x−z)dξ= 2π (zˆ(θ)·ξ) |ξ| eiξ·(x−z)dξ R2 R2 i (cid:90) = cos(θ−φ)sin(|ξ|t)eiξ·(x−z)dξ. 2π R2 19 --- Page 20 --- Acquisition scheme Method Number Full Time Error Error of time per it-n L L 2 ∞ iter-ns (sec.) (sec.) (%) (%) Inverse 1 1.3 (0.011) - 0.22 0.9 360◦, no noise Reversal 1 0.19 - 11 30 Inverse 1 1.3 (0.011) - 9.9 30 360◦, 30% noise TV 53 2.8 0.053 5.5 22 Inverse 1 1.3 (0.011) - 40 51 180◦ (partial), no noise NNLS 17 2. 0.12 0.5 2.8 NNLS 26 2.2 0.085 11 37 180◦ (partial), 30% noise TV 74 3 0.041 5.2 26 Inverse 1 1.3 (0.011) - 49 76 NNLS 83 3.2 0.039 18 62 180◦ (incomplete), 30% noise TV 83 4. 0.048 8.2 50 LPD 10 0.55 0.055 5 38 Inverse 1 1.3 (0.011) - 66 95 NNLS 231 6 0.026 26 79 120◦ (incomplete), 30% noise TV 137 4.3 0.031 20 69 LPD 10 0.55 0.055 11 63 Table 1: Summary of numerical simulations. The numbers in parentheses in the fourth column show computation time not counting pre-computation of Bessel functions. Now expression (28) for v(x) can be transformed as follows: T 2π   (cid:90) (cid:90) i (cid:90) v(x)=2 g(t,zˆ(θ)) cos(θ−φ)sin(|ξ|t)eiξ·(x−z)dξ dθdt 2π 0 0 R2  T2π   = i (cid:90) (cid:90) (cid:90) g(t,zˆ(θ))cos(θ−φ)sin(|ξ|t)e−iξ·zdθ dteiξ·xdξ =(cid:2) F−1vˆ(cid:3) (x), π 2D R2 0 0 where T2π  (cid:90) (cid:90) vˆ(ξ)=2i  g(t,zˆ(θ))cos(θ−φ)sin(λt)e−iξ·zdθ dt 0 0 Use the Fourier series (15) for g to simplify the inner integral in the above equation: (cid:90)2π(cid:34) ∞ (cid:35) ∞ (cid:90)2π (cid:88) (cid:88) g (t)eikθ cos(θ−φ)sin(λt)e−iξ·zdθ = g (t)sin(λt) eikθcos(θ−φ)e−iξ·zdθ k k 0 k=−∞ k=−∞ 0 ∞ (cid:88) = g (t)sin(λt)I (φ,λ), k k k=−∞ where we denote by I (φ,λ) the following integrals: k 2π 2π (cid:90) 1(cid:90) I (φ,λ)≡ eikθcos(θ−φ)e−iξ·zdθ = eikθ(ei(θ−φ)+e−i(θ−φ))e−iλcos(θ−φ)dθ k 2 0 0 2π 2π  1 (cid:90) (cid:90) = eikφ  ei(k+1)θe−iλcosθdθ+ ei(k−1)θe−iλcosθdθ. 2 0 0 20 --- Page 21 --- Using the Jacobi-Anger expansion (18) one obtains: (cid:90)2π (cid:90)2π (cid:32) ∞ (cid:33) (cid:88) ei(k±1)θe−iλcosθdθ = ei(k±1)θ (−i)|n|J (λ)einθ dθ =2π(−i)|k±1|J (λ). |n| |k±1| n=−∞ 0 0 Now I (φ,λ)=πeikφ[(−i)|k+1|J (λ)+(−i)|k−1|J (λ)]. (43) k |k+1| |k−1| By taking into account well-known properies of the Bessel functions, 1 J (λ)=−J′ (λ), (J (λ)−J (λ))=−J′ (λ), m∈Z, 1 0 2 m+1 m−1 m formula (43) simplifies to I (φ,λ)=2πieikφ(−i)|k|J′ (λ). k |k| We now have vˆ(ξ)= (cid:90)T(cid:32) ∞ (cid:33) (cid:90)T(cid:32) ∞ (cid:33) =2i (cid:88) g (t)sin(λt)I (φ,λ) dt=−4π (cid:88) g (t)sin(λt)eikφ(−i)|k|J′ (λ) dt k k k |k| 0 k=−∞ 0 k=−∞  T  ∞ (cid:90) =−4π (cid:88) eikφ(−i)|k|J |′ k|(λ) g k(t)sin(λt)dt k=−∞ 0 or T ∞ (cid:90) (cid:88) vˆ(ξ)= eikφvˆ (λ), vˆ (λ)≡−4π(−i)|k|J′ (λ) g (t)sin(λt)dt, k k |k| k k=−∞ 0 which coincides with equations (29), (30). Acknowledgments We would like to thank Janek Gr¨ohl for providing Figure 1. This work is supported by the Research Council of Finland with the Flagship of Advanced Math- ematics for Sensing Imaging and Modelling Project Nos. 359186, 358944, Centre of Excellence of Inverse Modelling and Imaging Project Nos. 353093, 353086, and the Academy Research Fellow ProjectNo. 338408. TheFinnishMinistryofEducationandCulture’sPilotforDoctoralProgrammes (Pilot project Mathematics of Sensing, Imaging and Modelling). The European Research Council (ERC)undertheEuropeanUnion’sHorizon2020ResearchandInnovationProgramme(GrantAgree- ment No. 101001417—QUANTOM). L.K. is partially supported by the NSF, through the Award No. NSF/DMS-2405348.",
  "discussion": "discussion. It is well known that the low order interpolation in the Fourier domain",
  "experiments": "experiments, in conjunction with various image reconstruction approaches, ranging from a straightforward application of the inverse operator, to TV image regularization and a deep-learning assisted method. A significant speed-up in computations provided by our algorithms is especially valuable in the context of iterative image reconstructionanddeep-learningassistedtomography,wherethenumberofoperatorevaluationsranges from hundreds to millions (for network training purposes). However, the purpose of the present paper wasnottoestablishwhichapproachis”better”,butrathertodemonstratetheefficiencyandversatility of the proposed fast algorithms, and their usefulness for future research of optimization and deep learning in the problems of PAT and TAT. Finally, we have published the codes for the presented",
  "references": "References [1] J.AdlerandO.O¨ktem,Solvingill-posedinverseproblemsusingiterativedeepneuralnetworks, Inverse Problems, 33 (2017), p. 124007. [2] , Learned primal-dual reconstruction, IEEE transactions on medical imaging, 37 (2018), pp. 1322–1332. 21 --- Page 22 --- [3] S. Arridge, P. Maass, O. O¨ktem, and C.-B. Scho¨nlieb, Solving inverse problems using data-driven models, Acta Numerica, 28 (2019), pp. 1–174. [4] S. R. Arridge, M. M. Betcke, B. T. Cox, F. Lucka, and B. E. Treeby, On the adjoint operator in photoacoustic tomography, Inverse Problems, 32 (2016), p. 115012. [5] Z. Belhachmi, T. Glatz, and O. Scherzer, A direct method for photoacoustic tomography with inhomogeneous sound speed, Inverse Problems, 32 (2016), p. 045005. [6] P. Burgholzer, G. J. Matt, M. Haltmeier, and G. Paltauf, Exact and approximative imaging"
}